MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
    /**
     * TDES0_IVL
     * ===================================================================================================
     * Offset: 0x224  TDES/DES Initial Vector Low Word Register for Channel 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |IVH_IVL   |TDES/DES Initial Vector High/Low Word
     * |        |          |Initial vector (IV) is for TDES/DES engine in CBC, CFB, and OFB mode.
     * |        |          |IV is Nonce counter for TDES/DES engine in CTR mode.
    */
    __IO uint32_t TDES0_IVL;

    /**
     * TDES0_SADDR
     * ===================================================================================================
     * Offset: 0x228  TDES/DES DMA Source Address Register for Channel 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |SADDR     |TDES/DES DMA Source Address
     * |        |          |The TDES/DES accelerator supports DMA function to transfer the plain text between system memory and embedded FIFO.
     * |        |          |The TDES_SADR keeps the source address of the data buffer where the source text is stored.
     * |        |          |Based on the source address, the TDES/DES accelerator can read the plain text from system memory and do TDES/DES operation.
     * |        |          |The start of source address should be located at word boundary.
     * |        |          |In other words, bit 1 and 0 of TDES_SADR are ignored.
     * |        |          |TDES_SADR can be read and written.
     * |        |          |Writing to TDES_SADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_SADR will be updated later on.
     * |        |          |Consequently, software can prepare the DMA source address for the next TDES/DES operation.
     * |        |          |In DMA mode, software can update the next TDES_SADR before triggering START.
     * |        |          |TDES_SADR and TDES_DADR can be the same in the value.
    */
    __IO uint32_t TDES0_SADDR;

    /**
     * TDES0_DADDR
     * ===================================================================================================
     * Offset: 0x22C  TDES/DES DMA Destination Address Register for Channel 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DADDR     |TDES/DES DMA Destination Address
     * |        |          |The TDES/DES accelerator supports DMA function to transfer the cipher text between system memory and embedded FIFO.
     * |        |          |The TDES_DADR keeps the destination address of the data buffer where the engine output's text will be stored.
     * |        |          |Based on the destination address, the TDES/DES accelerator can write the cipher text back to system memory after the TDES/DES operation is finished.
     * |        |          |The start of destination address should be located at word boundary.
     * |        |          |In other words, bit 1 and 0 of TDES_DADR are ignored.
     * |        |          |TDES_DADR can be read and written.
     * |        |          |Writing to TDES_DADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_DADR will be updated later on.
     * |        |          |Consequently, software can prepare the destination address for the next TDES/DES operation.
     * |        |          |In DMA mode, software can update the next TDES_DADR before triggering START.
     * |        |          |TDES_SADR and TDES_DADR can be the same in the value.
    */
    __IO uint32_t TDES0_DADDR;

    /**
     * TDES0_CNT
     * ===================================================================================================
     * Offset: 0x230  TDES/DES Byte Count Register for Channel 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CNT       |TDES/DES Byte Count
     * |        |          |The TDES_CNT keeps the byte count of source text that is for the TDES/DES engine operating in DMA mode.
     * |        |          |The TDES_CNT is 32-bit and the maximum of byte count is 4G bytes.
     * |        |          |TDES_CNT can be read and written.
     * |        |          |Writing to TDES_CNT while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_CNT will be updated later on.
     * |        |          |Consequently, software can prepare the byte count of data for the next TDES /DES operation.
     * |        |          |In Non-DMA ECB, CBC, CFB, OFB, and CTR mode, TDES_CNT must be set as byte count for the last block of data before feeding in the last block of data.
    */
    __IO uint32_t TDES0_CNT;

    /**
     * TDES_DATIN
     * ===================================================================================================
     * Offset: 0x234  TDES/DES Engine Input data Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DATIN     |TDES/DES Engine Input Port
     * |        |          |CPU feeds data to TDES/DES engine through this port by checking CRPT_TDES_STS.
     * |        |          |Feed data as INBUFFULL is 0.
    */
    __IO uint32_t TDES_DATIN;

    /**
     * TDES_DATOUT
     * ===================================================================================================
     * Offset: 0x238  TDES/DES Engine Output data Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DATOUT    |TDES/DES Engine Output Port
     * |        |          |CPU gets result from the TDES/DES engine through this port by checking CRPT_TDES_STS.
     * |        |          |Get data as OUTBUFEMPTY is 0.
    */
    __I  uint32_t TDES_DATOUT;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TDES1_KEY1H
     * ===================================================================================================
     * Offset: 0x248  TDES/DES Key 1 High Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY1H;

    /**
     * TDES1_KEY1L
     * ===================================================================================================
     * Offset: 0x24C  TDES/DES Key 1 Low Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY1L;

    /**
     * TDES1_KEY2H
     * ===================================================================================================
     * Offset: 0x250  TDES Key 2 High Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY2H;

    /**
     * TDES1_KEY2L
     * ===================================================================================================
     * Offset: 0x254  TDES Key 2 Low Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY2L;

    /**
     * TDES1_KEY3H
     * ===================================================================================================
     * Offset: 0x258  TDES Key 3 High Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY3H;

    /**
     * TDES1_KEY3L
     * ===================================================================================================
     * Offset: 0x25C  TDES Key 3 Low Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES1_KEY3L;

    /**
     * TDES1_IVH
     * ===================================================================================================
     * Offset: 0x260  TDES/DES Initial Vector High Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |IVH_IVL   |TDES/DES Initial Vector High/Low Word
     * |        |          |Initial vector (IV) is for TDES/DES engine in CBC, CFB, and OFB mode.
     * |        |          |IV is Nonce counter for TDES/DES engine in CTR mode.
    */
    __IO uint32_t TDES1_IVH;

    /**
     * TDES1_IVL
     * ===================================================================================================
     * Offset: 0x264  TDES/DES Initial Vector Low Word Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |IVH_IVL   |TDES/DES Initial Vector High/Low Word
     * |        |          |Initial vector (IV) is for TDES/DES engine in CBC, CFB, and OFB mode.
     * |        |          |IV is Nonce counter for TDES/DES engine in CTR mode.
    */
    __IO uint32_t TDES1_IVL;

    /**
     * TDES1_SADDR
     * ===================================================================================================
     * Offset: 0x268  TDES/DES DMA Source Address Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |SADDR     |TDES/DES DMA Source Address
     * |        |          |The TDES/DES accelerator supports DMA function to transfer the plain text between system memory and embedded FIFO.
     * |        |          |The TDES_SADR keeps the source address of the data buffer where the source text is stored.
     * |        |          |Based on the source address, the TDES/DES accelerator can read the plain text from system memory and do TDES/DES operation.
     * |        |          |The start of source address should be located at word boundary.
     * |        |          |In other words, bit 1 and 0 of TDES_SADR are ignored.
     * |        |          |TDES_SADR can be read and written.
     * |        |          |Writing to TDES_SADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_SADR will be updated later on.
     * |        |          |Consequently, software can prepare the DMA source address for the next TDES/DES operation.
     * |        |          |In DMA mode, software can update the next TDES_SADR before triggering START.
     * |        |          |TDES_SADR and TDES_DADR can be the same in the value.
    */
    __IO uint32_t TDES1_SADDR;

    /**
     * TDES1_DADDR
     * ===================================================================================================
     * Offset: 0x26C  TDES/DES DMA Destination Address Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DADDR     |TDES/DES DMA Destination Address
     * |        |          |The TDES/DES accelerator supports DMA function to transfer the cipher text between system memory and embedded FIFO.
     * |        |          |The TDES_DADR keeps the destination address of the data buffer where the engine output's text will be stored.
     * |        |          |Based on the destination address, the TDES/DES accelerator can write the cipher text back to system memory after the TDES/DES operation is finished.
     * |        |          |The start of destination address should be located at word boundary.
     * |        |          |In other words, bit 1 and 0 of TDES_DADR are ignored.
     * |        |          |TDES_DADR can be read and written.
     * |        |          |Writing to TDES_DADR while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_DADR will be updated later on.
     * |        |          |Consequently, software can prepare the destination address for the next TDES/DES operation.
     * |        |          |In DMA mode, software can update the next TDES_DADR before triggering START.
     * |        |          |TDES_SADR and TDES_DADR can be the same in the value.
    */
    __IO uint32_t TDES1_DADDR;

    /**
     * TDES1_CNT
     * ===================================================================================================
     * Offset: 0x270  TDES/DES Byte Count Register for Channel 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CNT       |TDES/DES Byte Count
     * |        |          |The TDES_CNT keeps the byte count of source text that is for the TDES/DES engine operating in DMA mode.
     * |        |          |The TDES_CNT is 32-bit and the maximum of byte count is 4G bytes.
     * |        |          |TDES_CNT can be read and written.
     * |        |          |Writing to TDES_CNT while the TDES/DES accelerator is operating doesn't affect the current TDES/DES operation.
     * |        |          |But the value of TDES_CNT will be updated later on.
     * |        |          |Consequently, software can prepare the byte count of data for the next TDES /DES operation.
     * |        |          |In Non-DMA ECB, CBC, CFB, OFB, and CTR mode, TDES_CNT must be set as byte count for the last block of data before feeding in the last block of data.
    */
    __IO uint32_t TDES1_CNT;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE3[5];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TDES2_KEY1H
     * ===================================================================================================
     * Offset: 0x288  TDES/DES Key 1 High Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY1H;

    /**
     * TDES2_KEY1L
     * ===================================================================================================
     * Offset: 0x28C  TDES/DES Key 1 Low Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY1L;

    /**
     * TDES2_KEY2H
     * ===================================================================================================
     * Offset: 0x290  TDES Key 2 High Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY2H;

    /**
     * TDES2_KEY2L
     * ===================================================================================================
     * Offset: 0x294  TDES Key 2 Low Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY2L;

    /**
     * TDES2_KEY3H
     * ===================================================================================================
     * Offset: 0x298  TDES Key 3 High Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY3H;

    /**
     * TDES2_KEY3L
     * ===================================================================================================
     * Offset: 0x29C  TDES Key 3 Low Word Register for Channel 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYH_KEYL |TDES/DES Key X High/Low Word
     * |        |          |The key registers for TDES/DES algorithm calculation
     * |        |          |The security key for the TDES/DES accelerator is 64 bits.
     * |        |          |Thus, it needs two 32-bit registers to store a security key.
     * |        |          |The register TDES_KEYxH is used to keep the bit [63:32] of security key for the TDES/DES operation, while the register TDES_KEYxL is used to keep the bit [31:0].
    */
    __IO uint32_t TDES2_KEY3L;

