MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
    /**
     * AD0TRGEN0
     * ===================================================================================================
     * Offset: 0x144  A/D trigger condition for SAMPLE00
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EPWM00REN |EPWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |EPWM00FEN |EPWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |EPWM00PEN |EPWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |EPWM00CEN |EPWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |EPWM02REN |EPWM0_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |EPWM02FEN |EPWM0_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |EPWM02PEN |EPWM0_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |EPWM02CEN |EPWM0_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |EPWM04REN |EPWM0_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |EPWM04FEN |EPWM0_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |EPWM04PEN |EPWM0_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |EPWM04CEN |EPWM0_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |EPWM10REN |EPWM1_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |EPWM10FEN |EPWM1_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |EPWM10PEN |EPWM1_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |EPWM10CEN |EPWM1_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |EPWM12REN |EPWM1_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |EPWM120FEN|EPWM1_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |EPWM12PEN |EPWM1_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |EPWM12CEN |EPWM1_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |EPWM14REN |EPWM1_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |EPWM14FEN |EPWM1_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |EPWM14PEN |EPWM1_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |EPWM14CEN |EPWM1_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM00REN  |PWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM00FEN  |PWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM00PEN  |PWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM00CEN  |PWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM01REN  |PWM0_CH1 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM01FEN  |PWM0_CH1 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM01PEN  |PWM0_CH1 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM01CEN  |PWM0_CH1 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t AD0TRGEN0;

    /**
     * AD0TRGEN1
     * ===================================================================================================
     * Offset: 0x148  A/D trigger condition for SAMPLE01
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EPWM00REN |EPWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |EPWM00FEN |EPWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |EPWM00PEN |EPWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |EPWM00CEN |EPWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |EPWM02REN |EPWM0_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |EPWM02FEN |EPWM0_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |EPWM02PEN |EPWM0_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |EPWM02CEN |EPWM0_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |EPWM04REN |EPWM0_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |EPWM04FEN |EPWM0_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |EPWM04PEN |EPWM0_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |EPWM04CEN |EPWM0_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |EPWM10REN |EPWM1_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |EPWM10FEN |EPWM1_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |EPWM10PEN |EPWM1_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |EPWM10CEN |EPWM1_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |EPWM12REN |EPWM1_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |EPWM120FEN|EPWM1_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |EPWM12PEN |EPWM1_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |EPWM12CEN |EPWM1_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |EPWM14REN |EPWM1_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |EPWM14FEN |EPWM1_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |EPWM14PEN |EPWM1_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |EPWM14CEN |EPWM1_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM00REN  |PWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM00FEN  |PWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM00PEN  |PWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM00CEN  |PWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM01REN  |PWM0_CH1 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM01FEN  |PWM0_CH1 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM01PEN  |PWM0_CH1 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM01CEN  |PWM0_CH1 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t AD0TRGEN1;

    /**
     * AD0TRGEN2
     * ===================================================================================================
     * Offset: 0x14C  A/D trigger condition for SAMPLE02
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EPWM00REN |EPWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |EPWM00FEN |EPWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |EPWM00PEN |EPWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |EPWM00CEN |EPWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |EPWM02REN |EPWM0_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |EPWM02FEN |EPWM0_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |EPWM02PEN |EPWM0_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |EPWM02CEN |EPWM0_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |EPWM04REN |EPWM0_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |EPWM04FEN |EPWM0_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |EPWM04PEN |EPWM0_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |EPWM04CEN |EPWM0_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |EPWM10REN |EPWM1_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |EPWM10FEN |EPWM1_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |EPWM10PEN |EPWM1_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |EPWM10CEN |EPWM1_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |EPWM12REN |EPWM1_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |EPWM120FEN|EPWM1_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |EPWM12PEN |EPWM1_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |EPWM12CEN |EPWM1_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |EPWM14REN |EPWM1_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |EPWM14FEN |EPWM1_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |EPWM14PEN |EPWM1_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |EPWM14CEN |EPWM1_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM00REN  |PWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM00FEN  |PWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM00PEN  |PWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM00CEN  |PWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM01REN  |PWM0_CH1 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM01FEN  |PWM0_CH1 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM01PEN  |PWM0_CH1 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM01CEN  |PWM0_CH1 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t AD0TRGEN2;

    /**
     * AD0TRGEN3
     * ===================================================================================================
     * Offset: 0x150  A/D trigger condition for SAMPLE03
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EPWM00REN |EPWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |EPWM00FEN |EPWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |EPWM00PEN |EPWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |EPWM00CEN |EPWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |EPWM02REN |EPWM0_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |EPWM02FEN |EPWM0_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |EPWM02PEN |EPWM0_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[7]     |EPWM02CEN |EPWM0_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[8]     |EPWM04REN |EPWM0_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[9]     |EPWM04FEN |EPWM0_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[10]    |EPWM04PEN |EPWM0_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[11]    |EPWM04CEN |EPWM0_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[12]    |EPWM10REN |EPWM1_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[13]    |EPWM10FEN |EPWM1_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[14]    |EPWM10PEN |EPWM1_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[15]    |EPWM10CEN |EPWM1_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[16]    |EPWM12REN |EPWM1_CH2 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[17]    |EPWM120FEN|EPWM1_CH2 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[18]    |EPWM12PEN |EPWM1_CH2 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[19]    |EPWM12CEN |EPWM1_CH2 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[20]    |EPWM14REN |EPWM1_CH4 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[21]    |EPWM14FEN |EPWM1_CH4 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[22]    |EPWM14PEN |EPWM1_CH4 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[23]    |EPWM14CEN |EPWM1_CH4 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[24]    |PWM00REN  |PWM0_CH0 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[25]    |PWM00FEN  |PWM0_CH0 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[26]    |PWM00PEN  |PWM0_CH0 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[27]    |PWM00CEN  |PWM0_CH0 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[28]    |PWM01REN  |PWM0_CH1 Rising Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[29]    |PWM01FEN  |PWM0_CH1 Falling Edge Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[30]    |PWM01PEN  |PWM0_CH1 Period Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[31]    |PWM01CEN  |PWM0_CH1 Center Trigger Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
    */
    __IO uint32_t AD0TRGEN3;

