MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define EADC_STATUS0_OV_Pos              (16)                                              /*!< EADC_T::STATUS0: OV Position              */
#define EADC_STATUS0_OV_Msk              (0xfffful << EADC_STATUS0_OV_Pos)                 /*!< EADC_T::STATUS0: OV Mask                  */

#define EADC_STATUS1_ADIF0_Pos           (0)                                               /*!< EADC_T::STATUS1: ADIF0 Position           */
#define EADC_STATUS1_ADIF0_Msk           (0x1ul << EADC_STATUS1_ADIF0_Pos)                 /*!< EADC_T::STATUS1: ADIF0 Mask               */

#define EADC_STATUS1_ADIF1_Pos           (1)                                               /*!< EADC_T::STATUS1: ADIF1 Position           */
#define EADC_STATUS1_ADIF1_Msk           (0x1ul << EADC_STATUS1_ADIF1_Pos)                 /*!< EADC_T::STATUS1: ADIF1 Mask               */

#define EADC_STATUS1_ADIF2_Pos           (2)                                               /*!< EADC_T::STATUS1: ADIF2 Position           */
#define EADC_STATUS1_ADIF2_Msk           (0x1ul << EADC_STATUS1_ADIF2_Pos)                 /*!< EADC_T::STATUS1: ADIF2 Mask               */

#define EADC_STATUS1_ADIF3_Pos           (3)                                               /*!< EADC_T::STATUS1: ADIF3 Position           */
#define EADC_STATUS1_ADIF3_Msk           (0x1ul << EADC_STATUS1_ADIF3_Pos)                 /*!< EADC_T::STATUS1: ADIF3 Mask               */

#define EADC_STATUS1_ADCMPO0_Pos         (4)                                               /*!< EADC_T::STATUS1: ADCMPO0 Position         */
#define EADC_STATUS1_ADCMPO0_Msk         (0x1ul << EADC_STATUS1_ADCMPO0_Pos)               /*!< EADC_T::STATUS1: ADCMPO0 Mask             */

#define EADC_STATUS1_ADCMPO1_Pos         (5)                                               /*!< EADC_T::STATUS1: ADCMPO1 Position         */
#define EADC_STATUS1_ADCMPO1_Msk         (0x1ul << EADC_STATUS1_ADCMPO1_Pos)               /*!< EADC_T::STATUS1: ADCMPO1 Mask             */

#define EADC_STATUS1_ADCMPF0_Pos         (6)                                               /*!< EADC_T::STATUS1: ADCMPF0 Position         */
#define EADC_STATUS1_ADCMPF0_Msk         (0x1ul << EADC_STATUS1_ADCMPF0_Pos)               /*!< EADC_T::STATUS1: ADCMPF0 Mask             */

#define EADC_STATUS1_ADCMPF1_Pos         (7)                                               /*!< EADC_T::STATUS1: ADCMPF1 Position         */
#define EADC_STATUS1_ADCMPF1_Msk         (0x1ul << EADC_STATUS1_ADCMPF1_Pos)               /*!< EADC_T::STATUS1: ADCMPF1 Mask             */

#define EADC_STATUS1_BUSY0_Pos           (8)                                               /*!< EADC_T::STATUS1: BUSY0 Position           */
#define EADC_STATUS1_BUSY0_Msk           (0x1ul << EADC_STATUS1_BUSY0_Pos)                 /*!< EADC_T::STATUS1: BUSY0 Mask               */

#define EADC_STATUS1_CHANNEL0_Pos        (12)                                              /*!< EADC_T::STATUS1: CHANNEL0 Position        */
#define EADC_STATUS1_CHANNEL0_Msk        (0xful << EADC_STATUS1_CHANNEL0_Pos)              /*!< EADC_T::STATUS1: CHANNEL0 Mask            */

#define EADC_STATUS1_BUSY1_Pos           (16)                                              /*!< EADC_T::STATUS1: BUSY1 Position           */
#define EADC_STATUS1_BUSY1_Msk           (0x1ul << EADC_STATUS1_BUSY1_Pos)                 /*!< EADC_T::STATUS1: BUSY1 Mask               */

#define EADC_STATUS1_CHANNEL1_Pos        (20)                                              /*!< EADC_T::STATUS1: CHANNEL1 Position        */
#define EADC_STATUS1_CHANNEL1_Msk        (0xful << EADC_STATUS1_CHANNEL1_Pos)              /*!< EADC_T::STATUS1: CHANNEL1 Mask            */

#define EADC_STATUS1_ADOVIF_Pos          (24)                                              /*!< EADC_T::STATUS1: ADOVIF Position          */
#define EADC_STATUS1_ADOVIF_Msk          (0x1ul << EADC_STATUS1_ADOVIF_Pos)                /*!< EADC_T::STATUS1: ADOVIF Mask              */

#define EADC_STATUS1_STOVF_Pos           (25)                                              /*!< EADC_T::STATUS1: STOVF Position           */
#define EADC_STATUS1_STOVF_Msk           (0x1ul << EADC_STATUS1_STOVF_Pos)                 /*!< EADC_T::STATUS1: STOVF Mask               */

#define EADC_STATUS1_AVALID_Pos          (26)                                              /*!< EADC_T::STATUS1: AVALID Position          */
#define EADC_STATUS1_AVALID_Msk          (0x1ul << EADC_STATUS1_AVALID_Pos)                /*!< EADC_T::STATUS1: AVALID Mask              */

#define EADC_STATUS1_AOV_Pos             (27)                                              /*!< EADC_T::STATUS1: AOV Position             */
#define EADC_STATUS1_AOV_Msk             (0x1ul << EADC_STATUS1_AOV_Pos)                   /*!< EADC_T::STATUS1: AOV Mask                 */

#define EADC_EXTSMPT_EXTSMPT0_Pos        (0)                                               /*!< EADC_T::EXTSMPT: EXTSMPT0 Position        */
#define EADC_EXTSMPT_EXTSMPT0_Msk        (0xfful << EADC_EXTSMPT_EXTSMPT0_Pos)             /*!< EADC_T::EXTSMPT: EXTSMPT0 Mask            */

#define EADC_EXTSMPT_EXTSMPT1_Pos        (16)                                              /*!< EADC_T::EXTSMPT: EXTSMPT1 Position        */
#define EADC_EXTSMPT_EXTSMPT1_Msk        (0xfful << EADC_EXTSMPT_EXTSMPT1_Pos)             /*!< EADC_T::EXTSMPT: EXTSMPT1 Mask            */

#define EADC_AD0DDAT0_RESULT_Pos         (0)                                               /*!< EADC_T::AD0DDAT0: RESULT Position         */
#define EADC_AD0DDAT0_RESULT_Msk         (0xffful << EADC_AD0DDAT0_RESULT_Pos)             /*!< EADC_T::AD0DDAT0: RESULT Mask             */

#define EADC_AD0DDAT0_VALID_Pos          (16)                                              /*!< EADC_T::AD0DDAT0: VALID Position          */
#define EADC_AD0DDAT0_VALID_Msk          (0x1ul << EADC_AD0DDAT0_VALID_Pos)                /*!< EADC_T::AD0DDAT0: VALID Mask              */

#define EADC_AD0DDAT1_RESULT_Pos         (0)                                               /*!< EADC_T::AD0DDAT1: RESULT Position         */
#define EADC_AD0DDAT1_RESULT_Msk         (0xffful << EADC_AD0DDAT1_RESULT_Pos)             /*!< EADC_T::AD0DDAT1: RESULT Mask             */

#define EADC_AD0DDAT1_VALID_Pos          (16)                                              /*!< EADC_T::AD0DDAT1: VALID Position          */
#define EADC_AD0DDAT1_VALID_Msk          (0x1ul << EADC_AD0DDAT1_VALID_Pos)                /*!< EADC_T::AD0DDAT1: VALID Mask              */

#define EADC_AD0DDAT2_RESULT_Pos         (0)                                               /*!< EADC_T::AD0DDAT2: RESULT Position         */
#define EADC_AD0DDAT2_RESULT_Msk         (0xffful << EADC_AD0DDAT2_RESULT_Pos)             /*!< EADC_T::AD0DDAT2: RESULT Mask             */

