MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define EADC_AD0DDAT2_VALID_Pos          (16)                                              /*!< EADC_T::AD0DDAT2: VALID Position          */
#define EADC_AD0DDAT2_VALID_Msk          (0x1ul << EADC_AD0DDAT2_VALID_Pos)                /*!< EADC_T::AD0DDAT2: VALID Mask              */

#define EADC_AD0DDAT3_RESULT_Pos         (0)                                               /*!< EADC_T::AD0DDAT3: RESULT Position         */
#define EADC_AD0DDAT3_RESULT_Msk         (0xffful << EADC_AD0DDAT3_RESULT_Pos)             /*!< EADC_T::AD0DDAT3: RESULT Mask             */

#define EADC_AD0DDAT3_VALID_Pos          (16)                                              /*!< EADC_T::AD0DDAT3: VALID Position          */
#define EADC_AD0DDAT3_VALID_Msk          (0x1ul << EADC_AD0DDAT3_VALID_Pos)                /*!< EADC_T::AD0DDAT3: VALID Mask              */

#define EADC_AD1DDAT0_RESULT_Pos         (0)                                               /*!< EADC_T::AD1DDAT0: RESULT Position         */
#define EADC_AD1DDAT0_RESULT_Msk         (0xffful << EADC_AD1DDAT0_RESULT_Pos)             /*!< EADC_T::AD1DDAT0: RESULT Mask             */

#define EADC_AD1DDAT0_VALID_Pos          (16)                                              /*!< EADC_T::AD1DDAT0: VALID Position          */
#define EADC_AD1DDAT0_VALID_Msk          (0x1ul << EADC_AD1DDAT0_VALID_Pos)                /*!< EADC_T::AD1DDAT0: VALID Mask              */

#define EADC_AD1DDAT1_RESULT_Pos         (0)                                               /*!< EADC_T::AD1DDAT1: RESULT Position         */
#define EADC_AD1DDAT1_RESULT_Msk         (0xffful << EADC_AD1DDAT1_RESULT_Pos)             /*!< EADC_T::AD1DDAT1: RESULT Mask             */

#define EADC_AD1DDAT1_VALID_Pos          (16)                                              /*!< EADC_T::AD1DDAT1: VALID Position          */
#define EADC_AD1DDAT1_VALID_Msk          (0x1ul << EADC_AD1DDAT1_VALID_Pos)                /*!< EADC_T::AD1DDAT1: VALID Mask              */

#define EADC_AD1DDAT2_RESULT_Pos         (0)                                               /*!< EADC_T::AD1DDAT2: RESULT Position         */
#define EADC_AD1DDAT2_RESULT_Msk         (0xffful << EADC_AD1DDAT2_RESULT_Pos)             /*!< EADC_T::AD1DDAT2: RESULT Mask             */

#define EADC_AD1DDAT2_VALID_Pos          (16)                                              /*!< EADC_T::AD1DDAT2: VALID Position          */
#define EADC_AD1DDAT2_VALID_Msk          (0x1ul << EADC_AD1DDAT2_VALID_Pos)                /*!< EADC_T::AD1DDAT2: VALID Mask              */

#define EADC_AD1DDAT3_RESULT_Pos         (0)                                               /*!< EADC_T::AD1DDAT3: RESULT Position         */
#define EADC_AD1DDAT3_RESULT_Msk         (0xffful << EADC_AD1DDAT3_RESULT_Pos)             /*!< EADC_T::AD1DDAT3: RESULT Mask             */

#define EADC_AD1DDAT3_VALID_Pos          (16)                                              /*!< EADC_T::AD1DDAT3: VALID Position          */
#define EADC_AD1DDAT3_VALID_Msk          (0x1ul << EADC_AD1DDAT3_VALID_Pos)                /*!< EADC_T::AD1DDAT3: VALID Mask              */

#define EADC_DBMEN_AD0DBM0_Pos           (0)                                               /*!< EADC_T::DBMEN: AD0DBM0 Position           */
#define EADC_DBMEN_AD0DBM0_Msk           (0x1ul << EADC_DBMEN_AD0DBM0_Pos)                 /*!< EADC_T::DBMEN: AD0DBM0 Mask               */

#define EADC_DBMEN_AD0DBM1_Pos           (1)                                               /*!< EADC_T::DBMEN: AD0DBM1 Position           */
#define EADC_DBMEN_AD0DBM1_Msk           (0x1ul << EADC_DBMEN_AD0DBM1_Pos)                 /*!< EADC_T::DBMEN: AD0DBM1 Mask               */

#define EADC_DBMEN_AD0DBM2_Pos           (2)                                               /*!< EADC_T::DBMEN: AD0DBM2 Position           */
#define EADC_DBMEN_AD0DBM2_Msk           (0x1ul << EADC_DBMEN_AD0DBM2_Pos)                 /*!< EADC_T::DBMEN: AD0DBM2 Mask               */

#define EADC_DBMEN_AD0DBM3_Pos           (3)                                               /*!< EADC_T::DBMEN: AD0DBM3 Position           */
#define EADC_DBMEN_AD0DBM3_Msk           (0x1ul << EADC_DBMEN_AD0DBM3_Pos)                 /*!< EADC_T::DBMEN: AD0DBM3 Mask               */

#define EADC_DBMEN_AD1DBM0_Pos           (8)                                               /*!< EADC_T::DBMEN: AD1DBM0 Position           */
#define EADC_DBMEN_AD1DBM0_Msk           (0x1ul << EADC_DBMEN_AD1DBM0_Pos)                 /*!< EADC_T::DBMEN: AD1DBM0 Mask               */

#define EADC_DBMEN_AD1DBM1_Pos           (9)                                               /*!< EADC_T::DBMEN: AD1DBM1 Position           */
#define EADC_DBMEN_AD1DBM1_Msk           (0x1ul << EADC_DBMEN_AD1DBM1_Pos)                 /*!< EADC_T::DBMEN: AD1DBM1 Mask               */

#define EADC_DBMEN_AD1DBM2_Pos           (10)                                              /*!< EADC_T::DBMEN: AD1DBM2 Position           */
#define EADC_DBMEN_AD1DBM2_Msk           (0x1ul << EADC_DBMEN_AD1DBM2_Pos)                 /*!< EADC_T::DBMEN: AD1DBM2 Mask               */

#define EADC_DBMEN_AD1DBM3_Pos           (11)                                              /*!< EADC_T::DBMEN: AD1DBM3 Position           */
#define EADC_DBMEN_AD1DBM3_Msk           (0x1ul << EADC_DBMEN_AD1DBM3_Pos)                 /*!< EADC_T::DBMEN: AD1DBM3 Mask               */

#define EADC_INTSRC0_AD0SPIE0_Pos        (0)                                               /*!< EADC_T::INTSRC: AD0SPIE0 Position        */
#define EADC_INTSRC0_AD0SPIE0_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE0_Pos)              /*!< EADC_T::INTSRC: AD0SPIE0 Mask            */

#define EADC_INTSRC0_AD0SPIE1_Pos        (1)                                               /*!< EADC_T::INTSRC: AD0SPIE1 Position        */
#define EADC_INTSRC0_AD0SPIE1_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE1_Pos)              /*!< EADC_T::INTSRC: AD0SPIE1 Mask            */

#define EADC_INTSRC0_AD0SPIE2_Pos        (2)                                               /*!< EADC_T::INTSRC: AD0SPIE2 Position        */
#define EADC_INTSRC0_AD0SPIE2_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE2_Pos)              /*!< EADC_T::INTSRC: AD0SPIE2 Mask            */

#define EADC_INTSRC0_AD0SPIE3_Pos        (3)                                               /*!< EADC_T::INTSRC: AD0SPIE3 Position        */
#define EADC_INTSRC0_AD0SPIE3_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE3_Pos)              /*!< EADC_T::INTSRC: AD0SPIE3 Mask            */

