MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define EADC_AD0TRGEN0_EPWM10PEN_Pos     (14)                                              /*!< EADC_T::AD0TRGEN0: EPWM10PEN Position     */
#define EADC_AD0TRGEN0_EPWM10PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM10PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM10PEN Mask         */

#define EADC_AD0TRGEN0_EPWM10CEN_Pos     (15)                                              /*!< EADC_T::AD0TRGEN0: EPWM10CEN Position     */
#define EADC_AD0TRGEN0_EPWM10CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM10CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM10CEN Mask         */

#define EADC_AD0TRGEN0_EPWM12REN_Pos     (16)                                              /*!< EADC_T::AD0TRGEN0: EPWM12REN Position     */
#define EADC_AD0TRGEN0_EPWM12REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM12REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM12REN Mask         */

#define EADC_AD0TRGEN0_EPWM120FEN_Pos    (17)                                              /*!< EADC_T::AD0TRGEN0: EPWM120FEN Position    */
#define EADC_AD0TRGEN0_EPWM120FEN_Msk    (0x1ul << EADC_AD0TRGEN0_EPWM120FEN_Pos)          /*!< EADC_T::AD0TRGEN0: EPWM120FEN Mask        */

#define EADC_AD0TRGEN0_EPWM12PEN_Pos     (18)                                              /*!< EADC_T::AD0TRGEN0: EPWM12PEN Position     */
#define EADC_AD0TRGEN0_EPWM12PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM12PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM12PEN Mask         */

#define EADC_AD0TRGEN0_EPWM12CEN_Pos     (19)                                              /*!< EADC_T::AD0TRGEN0: EPWM12CEN Position     */
#define EADC_AD0TRGEN0_EPWM12CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM12CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM12CEN Mask         */

#define EADC_AD0TRGEN0_EPWM14REN_Pos     (20)                                              /*!< EADC_T::AD0TRGEN0: EPWM14REN Position     */
#define EADC_AD0TRGEN0_EPWM14REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM14REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM14REN Mask         */

#define EADC_AD0TRGEN0_EPWM14FEN_Pos     (21)                                              /*!< EADC_T::AD0TRGEN0: EPWM14FEN Position     */
#define EADC_AD0TRGEN0_EPWM14FEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM14FEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM14FEN Mask         */

#define EADC_AD0TRGEN0_EPWM14PEN_Pos     (22)                                              /*!< EADC_T::AD0TRGEN0: EPWM14PEN Position     */
#define EADC_AD0TRGEN0_EPWM14PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM14PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM14PEN Mask         */

#define EADC_AD0TRGEN0_EPWM14CEN_Pos     (23)                                              /*!< EADC_T::AD0TRGEN0: EPWM14CEN Position     */
#define EADC_AD0TRGEN0_EPWM14CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM14CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM14CEN Mask         */

#define EADC_AD0TRGEN0_PWM00REN_Pos      (24)                                              /*!< EADC_T::AD0TRGEN0: PWM00REN Position      */
#define EADC_AD0TRGEN0_PWM00REN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM00REN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM00REN Mask          */

#define EADC_AD0TRGEN0_PWM00FEN_Pos      (25)                                              /*!< EADC_T::AD0TRGEN0: PWM00FEN Position      */
#define EADC_AD0TRGEN0_PWM00FEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM00FEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM00FEN Mask          */

#define EADC_AD0TRGEN0_PWM00PEN_Pos      (26)                                              /*!< EADC_T::AD0TRGEN0: PWM00PEN Position      */
#define EADC_AD0TRGEN0_PWM00PEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM00PEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM00PEN Mask          */

#define EADC_AD0TRGEN0_PWM00CEN_Pos      (27)                                              /*!< EADC_T::AD0TRGEN0: PWM00CEN Position      */
#define EADC_AD0TRGEN0_PWM00CEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM00CEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM00CEN Mask          */

#define EADC_AD0TRGEN0_PWM01REN_Pos      (28)                                              /*!< EADC_T::AD0TRGEN0: PWM01REN Position      */
#define EADC_AD0TRGEN0_PWM01REN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM01REN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM01REN Mask          */

#define EADC_AD0TRGEN0_PWM01FEN_Pos      (29)                                              /*!< EADC_T::AD0TRGEN0: PWM01FEN Position      */
#define EADC_AD0TRGEN0_PWM01FEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM01FEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM01FEN Mask          */

#define EADC_AD0TRGEN0_PWM01PEN_Pos      (30)                                              /*!< EADC_T::AD0TRGEN0: PWM01PEN Position      */
#define EADC_AD0TRGEN0_PWM01PEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM01PEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM01PEN Mask          */

#define EADC_AD0TRGEN0_PWM01CEN_Pos      (31)                                              /*!< EADC_T::AD0TRGEN0: PWM01CEN Position      */
#define EADC_AD0TRGEN0_PWM01CEN_Msk      (0x1ul << EADC_AD0TRGEN0_PWM01CEN_Pos)            /*!< EADC_T::AD0TRGEN0: PWM01CEN Mask          */

#define EADC_AD0TRGEN1_EPWM00REN_Pos     (0)                                               /*!< EADC_T::AD0TRGEN1: EPWM00REN Position     */
#define EADC_AD0TRGEN1_EPWM00REN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM00REN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM00REN Mask         */

#define EADC_AD0TRGEN1_EPWM00FEN_Pos     (1)                                               /*!< EADC_T::AD0TRGEN1: EPWM00FEN Position     */
#define EADC_AD0TRGEN1_EPWM00FEN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM00FEN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM00FEN Mask         */

#define EADC_AD0TRGEN1_EPWM00PEN_Pos     (2)                                               /*!< EADC_T::AD0TRGEN1: EPWM00PEN Position     */
#define EADC_AD0TRGEN1_EPWM00PEN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM00PEN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM00PEN Mask         */

#define EADC_AD0TRGEN1_EPWM00CEN_Pos     (3)                                               /*!< EADC_T::AD0TRGEN1: EPWM00CEN Position     */
#define EADC_AD0TRGEN1_EPWM00CEN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM00CEN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM00CEN Mask         */

#define EADC_AD0TRGEN1_EPWM02REN_Pos     (4)                                               /*!< EADC_T::AD0TRGEN1: EPWM02REN Position     */
#define EADC_AD0TRGEN1_EPWM02REN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM02REN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM02REN Mask         */

#define EADC_AD0TRGEN1_EPWM02FEN_Pos     (5)                                               /*!< EADC_T::AD0TRGEN1: EPWM02FEN Position     */
#define EADC_AD0TRGEN1_EPWM02FEN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM02FEN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM02FEN Mask         */

#define EADC_AD0TRGEN1_EPWM02PEN_Pos     (6)                                               /*!< EADC_T::AD0TRGEN1: EPWM02PEN Position     */
#define EADC_AD0TRGEN1_EPWM02PEN_Msk     (0x1ul << EADC_AD0TRGEN1_EPWM02PEN_Pos)           /*!< EADC_T::AD0TRGEN1: EPWM02PEN Mask         */

