MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define EADC_AD1TRGEN0_PWM01FEN_Pos      (29)                                              /*!< EADC_T::AD1TRGEN0: PWM01FEN Position      */
#define EADC_AD1TRGEN0_PWM01FEN_Msk      (0x1ul << EADC_AD1TRGEN0_PWM01FEN_Pos)            /*!< EADC_T::AD1TRGEN0: PWM01FEN Mask          */

#define EADC_AD1TRGEN0_PWM01PEN_Pos      (30)                                              /*!< EADC_T::AD1TRGEN0: PWM01PEN Position      */
#define EADC_AD1TRGEN0_PWM01PEN_Msk      (0x1ul << EADC_AD1TRGEN0_PWM01PEN_Pos)            /*!< EADC_T::AD1TRGEN0: PWM01PEN Mask          */

#define EADC_AD1TRGEN0_PWM01CEN_Pos      (31)                                              /*!< EADC_T::AD1TRGEN0: PWM01CEN Position      */
#define EADC_AD1TRGEN0_PWM01CEN_Msk      (0x1ul << EADC_AD1TRGEN0_PWM01CEN_Pos)            /*!< EADC_T::AD1TRGEN0: PWM01CEN Mask          */

#define EADC_AD1TRGEN1_EPWM00REN_Pos     (0)                                               /*!< EADC_T::AD1TRGEN1: EPWM00REN Position     */
#define EADC_AD1TRGEN1_EPWM00REN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM00REN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM00REN Mask         */

#define EADC_AD1TRGEN1_EPWM00FEN_Pos     (1)                                               /*!< EADC_T::AD1TRGEN1: EPWM00FEN Position     */
#define EADC_AD1TRGEN1_EPWM00FEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM00FEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM00FEN Mask         */

#define EADC_AD1TRGEN1_EPWM00PEN_Pos     (2)                                               /*!< EADC_T::AD1TRGEN1: EPWM00PEN Position     */
#define EADC_AD1TRGEN1_EPWM00PEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM00PEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM00PEN Mask         */

#define EADC_AD1TRGEN1_EPWM00CEN_Pos     (3)                                               /*!< EADC_T::AD1TRGEN1: EPWM00CEN Position     */
#define EADC_AD1TRGEN1_EPWM00CEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM00CEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM00CEN Mask         */

#define EADC_AD1TRGEN1_EPWM02REN_Pos     (4)                                               /*!< EADC_T::AD1TRGEN1: EPWM02REN Position     */
#define EADC_AD1TRGEN1_EPWM02REN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM02REN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM02REN Mask         */

#define EADC_AD1TRGEN1_EPWM02FEN_Pos     (5)                                               /*!< EADC_T::AD1TRGEN1: EPWM02FEN Position     */
#define EADC_AD1TRGEN1_EPWM02FEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM02FEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM02FEN Mask         */

#define EADC_AD1TRGEN1_EPWM02PEN_Pos     (6)                                               /*!< EADC_T::AD1TRGEN1: EPWM02PEN Position     */
#define EADC_AD1TRGEN1_EPWM02PEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM02PEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM02PEN Mask         */

#define EADC_AD1TRGEN1_EPWM02CEN_Pos     (7)                                               /*!< EADC_T::AD1TRGEN1: EPWM02CEN Position     */
#define EADC_AD1TRGEN1_EPWM02CEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM02CEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM02CEN Mask         */

#define EADC_AD1TRGEN1_EPWM04REN_Pos     (8)                                               /*!< EADC_T::AD1TRGEN1: EPWM04REN Position     */
#define EADC_AD1TRGEN1_EPWM04REN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM04REN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM04REN Mask         */

#define EADC_AD1TRGEN1_EPWM04FEN_Pos     (9)                                               /*!< EADC_T::AD1TRGEN1: EPWM04FEN Position     */
#define EADC_AD1TRGEN1_EPWM04FEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM04FEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM04FEN Mask         */

#define EADC_AD1TRGEN1_EPWM04PEN_Pos     (10)                                              /*!< EADC_T::AD1TRGEN1: EPWM04PEN Position     */
#define EADC_AD1TRGEN1_EPWM04PEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM04PEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM04PEN Mask         */

#define EADC_AD1TRGEN1_EPWM04CEN_Pos     (11)                                              /*!< EADC_T::AD1TRGEN1: EPWM04CEN Position     */
#define EADC_AD1TRGEN1_EPWM04CEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM04CEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM04CEN Mask         */

#define EADC_AD1TRGEN1_EPWM10REN_Pos     (12)                                              /*!< EADC_T::AD1TRGEN1: EPWM10REN Position     */
#define EADC_AD1TRGEN1_EPWM10REN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM10REN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM10REN Mask         */

#define EADC_AD1TRGEN1_EPWM10FEN_Pos     (13)                                              /*!< EADC_T::AD1TRGEN1: EPWM10FEN Position     */
#define EADC_AD1TRGEN1_EPWM10FEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM10FEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM10FEN Mask         */

#define EADC_AD1TRGEN1_EPWM10PEN_Pos     (14)                                              /*!< EADC_T::AD1TRGEN1: EPWM10PEN Position     */
#define EADC_AD1TRGEN1_EPWM10PEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM10PEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM10PEN Mask         */

#define EADC_AD1TRGEN1_EPWM10CEN_Pos     (15)                                              /*!< EADC_T::AD1TRGEN1: EPWM10CEN Position     */
#define EADC_AD1TRGEN1_EPWM10CEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM10CEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM10CEN Mask         */

#define EADC_AD1TRGEN1_EPWM12REN_Pos     (16)                                              /*!< EADC_T::AD1TRGEN1: EPWM12REN Position     */
#define EADC_AD1TRGEN1_EPWM12REN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM12REN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM12REN Mask         */

#define EADC_AD1TRGEN1_EPWM120FEN_Pos    (17)                                              /*!< EADC_T::AD1TRGEN1: EPWM120FEN Position    */
#define EADC_AD1TRGEN1_EPWM120FEN_Msk    (0x1ul << EADC_AD1TRGEN1_EPWM120FEN_Pos)          /*!< EADC_T::AD1TRGEN1: EPWM120FEN Mask        */

#define EADC_AD1TRGEN1_EPWM12PEN_Pos     (18)                                              /*!< EADC_T::AD1TRGEN1: EPWM12PEN Position     */
#define EADC_AD1TRGEN1_EPWM12PEN_Msk     (0x1ul << EADC_AD1TRGEN1_EPWM12PEN_Pos)           /*!< EADC_T::AD1TRGEN1: EPWM12PEN Mask         */

