MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
} DSCT_T;

typedef struct {
    DSCT_T DSCT[16];
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[192];
    /// @endcond //HIDDEN_SYMBOLS

    /**
     * CHCTL
     * ===================================================================================================
     * Offset: 0x400  PDMA Channel Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CHEN      |PDMA Channel Enable Control Bit[X]
     * |        |          |Set this bit to 1 to enable PDMA[x] operation.
     * |        |          |0 = PDMA channel [x] Disabled.
     * |        |          |1 = PDMA channel [x] Enabled.
     * |        |          |Note1: If software stops each PDMA transfer by setting PDMA_STOP register, this bit will be cleared automatically after finishing current transfer.
     * |        |          |Note2: Software reset (writing 0xFFFF_FFF to PDMA_STOP register) will clear this bit.
     * |        |          |Note3: If each channel is not set as enabled, each channel cannot be active.
    */
    __IO uint32_t CHCTL;

    /**
     * STOP
     * ===================================================================================================
     * Offset: 0x404  PDMA Stop Transfer Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |STOP      |PDMA Stop Transfer Bit [X]
     * |        |          |User can stop the PDMA transfer by software reset (writing all '1' to PDMA_STOP register) or by PDMA_STOP register.
     * |        |          |The difference between software reset and PDMA_STOP register is when software set software reset, the operation will be stopped imminently that include the on-going transfer and the channel enable bit and request active flag will be cleared to '0'.
     * |        |          |When software set PDMA_STOP bit, the operation will finish the on-going transfer channel and then clear the channel enable bit and request active flag.
     * |        |          |Software can poll channel enable bit to know if the on-going transfer is finished.
     * |        |          |0 = No effect.
     * |        |          |1 = Stop PDMA transfer[x].
     * |        |          |Note1: This field is Write-Only
     * |        |          |Note2: Setting all PDMA_STOP bit to "1" will generate software reset to reset internal state machine (the embedded table will not be reset).
    */
    __O  uint32_t STOP;

    /**
     * SWREQ
     * ===================================================================================================
     * Offset: 0x408  PDMA Software Request Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |SWREQ     |PDMA Software Request Bit [X]
     * |        |          |Set this bit to 1 to generate a software request to PDMA [x].
     * |        |          |0 = No effect.
     * |        |          |1 = Generate a software request.
     * |        |          |Note1: This field is Write-Only.
     * |        |          |Software can indicate which channel is on active by reading PDMA_TRGSTS register.
     * |        |          |Active flag may be triggered by software request or peripheral request.
     * |        |          |Note2: If user does not enable each PDMA channel, the software request will be ignored.
    */
    __O  uint32_t SWREQ;

    /**
     * TRGSTS
     * ===================================================================================================
     * Offset: 0x40C  PDMA Request Active Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |REQSTS    |PDMA Request Active Flag [X]
     * |        |          |This flag indicates whether channel[x] have a request or not.
     * |        |          |0 = Have no requests.
     * |        |          |1 = Have a request.
     * |        |          |Note1: The request may come from software request (SWREQ) or peripheral request.
     * |        |          |Note2: When PDMA finishes channel transfer, this bit will be cleared automatically
     * |        |          |Note3: Software reset (setting PDMA_STOP to 0xFFFF_FFFF) will clear this bit.
    */
    __I  uint32_t TRGSTS;

    /**
     * PRISET
     * ===================================================================================================
     * Offset: 0x410  PDMA Fixed Priority Setting Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FPRISET   |PDMA Fixed Priority Setting Bit[X]
     * |        |          |Set this bit to 1 to enable fix priority level.
     * |        |          |0 = No effect.
     * |        |          |1 = Set PDMA channel [x] be fixed priority channel.
     * |        |          |The PDMA channel priority is shown in the following table.
    */
    __IO uint32_t PRISET;

    /**
     * PRICLR
     * ===================================================================================================
     * Offset: 0x414  PDMA Fixed Priority Clear Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FPRICLR   |PDMA Fix Priority Clear Bit [X]
     * |        |          |Set this bit to 1 to clear fixed priority level.
     * |        |          |0 = No effect.
     * |        |          |1 = Set PDMA channel [x] to be round-robin priority channel.
     * |        |          |Note: This field is Write-Only, and software can indicate the channel priority by reading PDMA_FPIOSEL register.
    */
    __O  uint32_t PRICLR;

    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x418  PDMA Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |INTEN     |PDMA Interrupt Enable Control Register [X]
     * |        |          |This field is used for enabling PDMA channel[x] interrupt.
     * |        |          |0 = PDMA channel [x] interrupt Disabled.
     * |        |          |1 = PDMA channel [x] interrupt Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x41C  PDMA Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ABTIF     |PDMA Read/Write Target Abort Interrupt Status Flag
     * |        |          |This bit indicates that PDMA has target abort error; Software can read PDMA_TABORTF register to find which channel has target abort error.
     * |        |          |0 = No bus ERROR response received.
     * |        |          |1 = Bus ERROR response received.
     * |        |          |Note: This field is read only.
     * |[1]     |TDIF      |Transfer Done Interrupt Status Flag
     * |        |          |This bit indicates that PDMA has finished transmission; Software can read PDMA_TDSTS register to indicate which channel finished transfer.
     * |        |          |0 = Not finished yet.
     * |        |          |1 = PDMA channel has finished transmission.
     * |        |          |Note: This field is Read only.
     * |[2]     |TEIF      |Table Empty Interrupt Status Flag
     * |        |          |This bit indicates that PDMA has finished each table transmission and the operation is Stop mode.
     * |        |          |Software can read TEIF register to indicate which channel finished transfer.
     * |        |          |0 = Not finished yet.
     * |        |          |1 = PDMA channel has finished and the operation is Stop mode.
     * |        |          |Note: This field is Read only.
    */
    __IO uint32_t INTSTS;

    /**
     * ABTSTS
     * ===================================================================================================
     * Offset: 0x420  PDMA Read/Write Target Abort Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |ABTIF     |PDMA Read/Write Target Abort Interrupt Status Flag
     * |        |          |This bit indicates which PDMA has target abort error
     * |        |          |0 = No bus ERROR response received.
     * |        |          |1 = Bus ERROR response received.
     * |        |          |Note: This field is read only, but software can write 1 to clear it.
    */
    __IO uint32_t ABTSTS;

    /**
     * TDSTS
     * ===================================================================================================
     * Offset: 0x424  PDMA Transfer Done Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |TDIF      |Transfer Done Flag [X]
     * |        |          |This bit indicates which PDMA channel has finished transmission.
     * |        |          |0 = Not finished yet.
     * |        |          |1 = PDMA channel has finished transmission.
     * |        |          |Note: This field is read only, but software can write 1 to clear.
    */
    __IO uint32_t TDSTS;

    /**
     * SCATSTS
     * ===================================================================================================
     * Offset: 0x428  PDMA Scatter-Gather Transfer Done Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |TEMPTYF   |Table Empty Flag Bit [X]
     * |        |          |This bit indicates which PDMA channel table has finished transmission and the operation mode is Stop mode
     * |        |          |0 = Not finished or not in Stop mode.
     * |        |          |1 = PDMA channel has finished transmission and the operation is Stop mode.
     * |        |          |Note: This field is read only, but software can write 1 to clear.
    */
    __IO uint32_t SCATSTS;

    /**
     * TACTSTS
     * ===================================================================================================
     * Offset: 0x42C  PDMA Transfer on Active Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |TXACTF    |Transfer On Active Flag Bit [X]
     * |        |          |This bit indicates which PDMA channel is on active.
     * |        |          |0 = PDMA channel is not finished.
     * |        |          |1 = PDMA channel is on active.
    */
    __I  uint32_t TACTSTS;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SCATBA
     * ===================================================================================================
     * Offset: 0x43C  PDMA Scatter-Gather Descriptor Table  Base Address  Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:31] |SCATBA    |PDMA Scatter-Gather Descriptor Table Base Address Bits
     * |        |          |In Scatter-Gather mode, this is the base address for calculating the next link - list address.
     * |        |          |The next link address equation is.
     * |        |          |Next Link Address = { SCATBA[15:0], EMBTA_NTAAR[15:2], 2'b00}.
     * |        |          |Note: Only useful in Scatter-Gather mode.
    */
    __IO uint32_t SCATBA;

    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[16];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * REQSEL0_3
     * ===================================================================================================
     * Offset: 0x480  PDMA Source Module Select Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:4]   |REQSRC0   |Channel 0 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 0.
     * |        |          |Software can configure the peripheral by setting REQSRC0.
     * |        |          |00000 = Connect to SPI0_TX.
     * |        |          |00001 = Connect to SPI1_TX.
     * |        |          |00010 = Connect to SPI2_TX.
     * |        |          |00011 = Connect to SPI3_TX.
     * |        |          |00100 = Connect to UART0_TX.
     * |        |          |00101 = Connect to UART1_TX.
     * |        |          |00110 = Connect to UART2_TX.
     * |        |          |00111 = Connect to UART3_TX.
     * |        |          |01000 = Connect to UART4_TX.
     * |        |          |01001 = Connect to UART5_TX.
     * |        |          |01010 = Reserved.
     * |        |          |01011 = Connect to I2S_TX.
     * |        |          |01100 = Connect to I2S1_TX.
     * |        |          |01101 = Connect to SPI0_RX.
     * |        |          |01110 = Connect to SPI1_RX.
     * |        |          |01111 = Connect to SPI2_RX.
     * |        |          |10000 = Connect to SPI3_RX.
     * |        |          |10001 = Connect to UART0_RX.
     * |        |          |10010 = Connect to UART1_RX.
     * |        |          |10011 = Connect to UART2_RX.
     * |        |          |10100 = Connect to UART3_RX.
     * |        |          |10101 = Connect to UART4_RX.
     * |        |          |10110 = Connect to UART5_RX.
     * |        |          |10111 = Reserved.
     * |        |          |11000 = Connect to ADC.
     * |        |          |11001 = Connect to I2S_RX.
     * |        |          |11010 = Connect to I2S1_RX.
     * |        |          |Other = Reserved.
     * |[8:12]  |REQSRC1   |Channel 1 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 1.
     * |        |          |Software can configure the peripheral setting by REQSRC1.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[16:20] |REQSRC2   |Channel 2 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 2.
     * |        |          |Software can configure the peripheral setting by REQSRC2.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[24:28] |REQSRC3   |Channel 3 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 3.
     * |        |          |Software can configure the peripheral setting by REQSRC3.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
    */
    __IO uint32_t REQSEL0_3;

    /**
     * REQSEL4_7
     * ===================================================================================================
     * Offset: 0x484  PDMA Source Module Select Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:4]   |REQSRC4   |Channel 0 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 4.
     * |        |          |Software can configure the peripheral setting by REQSRC4.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[8:12]  |REQSRC5   |Channel 1 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 5.
     * |        |          |Software can configure the peripheral setting by REQSRC5.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[16:20] |REQSRC6   |Channel 6 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 6.
     * |        |          |Software can configure the peripheral setting by REQSRC6.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[24:28] |REQSRC7   |Channel 7 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 7.
     * |        |          |Software can configure the peripheral setting by REQSRC7.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
    */
    __IO uint32_t REQSEL4_7;

    /**
     * REQSEL8_11
     * ===================================================================================================
     * Offset: 0x488  PDMA Source Module Select Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:4]   |REQSRC8   |Channel 8 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 8.
     * |        |          |Software can configure the peripheral setting by REQSRC8.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[8:12]  |REQSRC9   |Channel 9 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 9.
     * |        |          |Software can configure the peripheral setting by REQSRC9.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[16:20] |REQSRC10  |Channel 10 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 10.
     * |        |          |Software can configure the peripheral setting by REQSRC10.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[24:28] |REQSRC11  |Channel 11 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 11.
     * |        |          |Software can configure the peripheral setting by REQSRC11.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
    */
    __IO uint32_t REQSEL8_11;

    /**
     * REQSEL12_15
     * ===================================================================================================
     * Offset: 0x48C  PDMA Source Module Select Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:4]   |REQSRC12  |Channel 12 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 12.
     * |        |          |Software can configure the peripheral setting by REQSRC12.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[8:12]  |REQSRC13  |Channel 13 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 13.
     * |        |          |Software can configure the peripheral setting by REQSRC13.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[16:20] |REQSRC14  |Channel 14 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 14.
     * |        |          |Software can configure the peripheral setting by REQSRC14.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
     * |[24:28] |REQSRC15  |Channel 15 Selection
     * |        |          |This filed defines which peripheral is connected to PDMA channel 15.
     * |        |          |Software can configure the peripheral setting by REQSRC15.
     * |        |          |The channel configuration is the same as REQSRC0 field.
     * |        |          |Please refer to the explanation of REQSRC0.
    */
    __IO uint32_t REQSEL12_15;

} PDMA_T;

/**
    @addtogroup PDMA_CONST PDMA Bit Field Definition
    Constant Definitions for PDMA Controller
@{ */

#define PDMA_DSCT_CTL_OPMODE_Pos         (0)                                               /*!< DSCT_T::CTL: OPMODE Position        */
#define PDMA_DSCT_CTL_OPMODE_Msk         (0x3ul << PDMA_DSCT_CTL_OPMODE_Pos)               /*!< DSCT_T::CTL: OPMODE Mask            */

#define PDMA_DSCT_CTL_TXTYPE_Pos         (2)                                               /*!< DSCT_T::CTL: TXTYPE Position        */
#define PDMA_DSCT_CTL_TXTYPE_Msk         (0x1ul << PDMA_DSCT_CTL_TXTYPE_Pos)               /*!< DSCT_T::CTL: TXTYPE Mask            */

#define PDMA_DSCT_CTL_BURSIZE_Pos        (4)                                               /*!< DSCT_T::CTL: BURSIZE Position       */
#define PDMA_DSCT_CTL_BURSIZE_Msk        (0x7ul << PDMA_DSCT_CTL_BURSIZE_Pos)              /*!< DSCT_T::CTL: BURSIZE Mask           */

#define PDMA_DSCT_CTL_TBINTDIS_Pos       (7)                                               /*!< DSCT_T::CTL: TBINTDIS Position      */
#define PDMA_DSCT_CTL_TBINTDIS_Msk       (0x1ul << PDMA_DSCT_CTL_TBINTDIS_Pos)             /*!< DSCT_T::CTL: TBINTDIS Mask          */

#define PDMA_DSCT_CTL_SAINC_Pos          (8)                                               /*!< DSCT_T::CTL: SAINC Position         */
#define PDMA_DSCT_CTL_SAINC_Msk          (0x3ul << PDMA_DSCT_CTL_SAINC_Pos)                /*!< DSCT_T::CTL: SAINC Mask             */

#define PDMA_DSCT_CTL_DAINC_Pos          (10)                                              /*!< DSCT_T::CTL: DAINC Position         */
#define PDMA_DSCT_CTL_DAINC_Msk          (0x3ul << PDMA_DSCT_CTL_DAINC_Pos)                /*!< DSCT_T::CTL: DAINC Mask             */

