MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define PDMA_REQSEL4_7_REQSRC4_Pos       (0)                                               /*!< PDMA_T::REQSEL4_7: REQSRC4 Position       */
#define PDMA_REQSEL4_7_REQSRC4_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC4_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC4 Mask           */

#define PDMA_REQSEL4_7_REQSRC5_Pos       (8)                                               /*!< PDMA_T::REQSEL4_7: REQSRC5 Position       */
#define PDMA_REQSEL4_7_REQSRC5_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC5_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC5 Mask           */

#define PDMA_REQSEL4_7_REQSRC6_Pos       (16)                                              /*!< PDMA_T::REQSEL4_7: REQSRC6 Position       */
#define PDMA_REQSEL4_7_REQSRC6_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC6_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC6 Mask           */

#define PDMA_REQSEL4_7_REQSRC7_Pos       (24)                                              /*!< PDMA_T::REQSEL4_7: REQSRC7 Position       */
#define PDMA_REQSEL4_7_REQSRC7_Msk       (0x1ful << PDMA_REQSEL4_7_REQSRC7_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC7 Mask           */

#define PDMA_REQSEL8_11_REQSRC8_Pos      (0)                                               /*!< PDMA_T::REQSEL8_11: REQSRC8 Position      */
#define PDMA_REQSEL8_11_REQSRC8_Msk      (0x1ful << PDMA_REQSEL8_11_REQSRC8_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC8 Mask          */

#define PDMA_REQSEL8_11_REQSRC9_Pos      (8)                                               /*!< PDMA_T::REQSEL8_11: REQSRC9 Position      */
#define PDMA_REQSEL8_11_REQSRC9_Msk      (0x1ful << PDMA_REQSEL8_11_REQSRC9_Pos)           /*!< PDMA_T::REQSEL8_11: REQSRC9 Mask          */

#define PDMA_REQSEL8_11_REQSRC10_Pos     (16)                                              /*!< PDMA_T::REQSEL8_11: REQSRC10 Position     */
#define PDMA_REQSEL8_11_REQSRC10_Msk     (0x1ful << PDMA_REQSEL8_11_REQSRC10_Pos)          /*!< PDMA_T::REQSEL8_11: REQSRC10 Mask         */

#define PDMA_REQSEL8_11_REQSRC11_Pos     (24)                                              /*!< PDMA_T::REQSEL8_11: REQSRC11 Position     */
#define PDMA_REQSEL8_11_REQSRC11_Msk     (0x1ful << PDMA_REQSEL8_11_REQSRC11_Pos)          /*!< PDMA_T::REQSEL8_11: REQSRC11 Mask         */

#define PDMA_REQSEL12_15_REQSRC12_Pos    (0)                                               /*!< PDMA_T::REQSEL12_15: REQSRC12 Position    */
#define PDMA_REQSEL12_15_REQSRC12_Msk    (0x1ful << PDMA_REQSEL12_15_REQSRC12_Pos)         /*!< PDMA_T::REQSEL12_15: REQSRC12 Mask        */

#define PDMA_REQSEL12_15_REQSRC13_Pos    (8)                                               /*!< PDMA_T::REQSEL12_15: REQSRC13 Position    */
#define PDMA_REQSEL12_15_REQSRC13_Msk    (0x1ful << PDMA_REQSEL12_15_REQSRC13_Pos)         /*!< PDMA_T::REQSEL12_15: REQSRC13 Mask        */

#define PDMA_REQSEL12_15_REQSRC14_Pos    (16)                                              /*!< PDMA_T::REQSEL12_15: REQSRC14 Position    */
#define PDMA_REQSEL12_15_REQSRC14_Msk    (0x1ful << PDMA_REQSEL12_15_REQSRC14_Pos)         /*!< PDMA_T::REQSEL12_15: REQSRC14 Mask        */

#define PDMA_REQSEL12_15_REQSRC15_Pos    (24)                                              /*!< PDMA_T::REQSEL12_15: REQSRC15 Position    */
#define PDMA_REQSEL12_15_REQSRC15_Msk    (0x1ful << PDMA_REQSEL12_15_REQSRC15_Pos)         /*!< PDMA_T::REQSEL12_15: REQSRC15 Mask        */

/**@}*/ /* PDMA_CONST */
/**@}*/ /* end of PDMA register group */


/*---------------------- PS/2 Device Controller -------------------------*/
/**
    @addtogroup PS2 PS/2 Device Controller(PS2)
    Memory Mapped Structure for PS2 Controller
@{ */

typedef struct {


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  PS/2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PS2EN     |PS/2 Device Enable Control
     * |        |          |Enable PS/2 device controller.
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |TXIEN     |Transmit Interrupt Enable Control
     * |        |          |0 = Data transmit complete interrupt Disabled.
     * |        |          |1 = Data transmit complete interrupt Enabled.
     * |[2]     |RXIEN     |Receive Interrupt Enable Control
     * |        |          |0 = Data receive complete interrupt Disabled.
     * |        |          |1 = Data receive complete interrupt Enabled.
     * |[3:6]   |TXFDEPTH  |Transmit Data FIFO Depth
     * |        |          |There is 16-byte buffer for data transmit.
     * |        |          |Software can define the FIFO depth from 1 to 16 bytes depending on the application.
     * |        |          |0 = 1 byte.
     * |        |          |1 = 2 bytes.
     * |        |          |...
     * |        |          |14 = 15 bytes.
     * |        |          |15 = 16 bytes.
     * |[7]     |ACK       |Acknowledge Enable Control
     * |        |          |0 = Always sends acknowledge to host at 12th clock for host to device communication.
     * |        |          |1 = If parity error or stop bit is not received correctly, acknowledge bit will not be sent to host at 12th clock.
     * |[8]     |CLRFIFO   |Clear TX FIFO
     * |        |          |Write 1 to this bit to terminate device to host transmission.
     * |        |          |The TXEMPTY(PS2_STATUS[7]) bit will be set to 1 and pointer BYTEIDEX(PS2_STATUS[11:8]) is reset to 0 regardless there is residue data in buffer or not.
     * |        |          |The buffer content is not been cleared.
     * |        |          |0 = Not active.
     * |        |          |1 = Clear FIFO.
     * |[9]     |OVERRIDE  |Software Override PS/2 CLK/DATA Pin State
     * |        |          |0 = CLKSTAT and DATSTAT pins are controlled by internal state machine.
     * |        |          |1 = CLKSTAT and DATSTAT pins are controlled by software.
     * |[10]    |FPS2CLK   |Force CLKSTAT Line
     * |        |          |It forces CLKSTAT line high or low regardless of the internal state of the device controller if OVERRIDE is set to high.
     * |        |          |0 = Force CLKSTAT line low.
     * |        |          |1 = Force CLKSTAT line high.
     * |[11]    |FPS2DAT   |Force DATSTAT Line
     * |        |          |It forces DATSTAT high or low regardless of the internal state of the device controller if OVERRIDE is set to high.
     * |        |          |0 = Force DATSTAT low.
     * |        |          |1 = Force DATSTAT high.
    */
    __IO uint32_t CTL;

    /**
     * TXDAT0
     * ===================================================================================================
     * Offset: 0x04  PS/2 Transmit DATA Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DAT       |Transmit Data
     * |        |          |Write data to this register starts device to host communication if bus is in IDLE state.
     * |        |          |Software must enable PS2EN(PS2_CTL[0]) before writing data to TX buffer.
    */
    __IO uint32_t TXDAT0;

    /**
     * TXDAT1
     * ===================================================================================================
     * Offset: 0x08  PS/2 Transmit DATA Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DAT       |Transmit Data
     * |        |          |Write data to this register starts device to host communication if bus is in IDLE state.
     * |        |          |Software must enable PS2EN(PS2_CTL[0]) before writing data to TX buffer.
    */
    __IO uint32_t TXDAT1;

    /**
     * TXDAT2
     * ===================================================================================================
     * Offset: 0x0C  PS/2 Transmit DATA Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DAT       |Transmit Data
     * |        |          |Write data to this register starts device to host communication if bus is in IDLE state.
     * |        |          |Software must enable PS2EN(PS2_CTL[0]) before writing data to TX buffer.
    */
    __IO uint32_t TXDAT2;

    /**
     * TXDAT3
     * ===================================================================================================
     * Offset: 0x10  PS/2 Transmit DATA Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DAT       |Transmit Data
     * |        |          |Write data to this register starts device to host communication if bus is in IDLE state.
     * |        |          |Software must enable PS2EN(PS2_CTL[0]) before writing data to TX buffer.
    */
    __IO uint32_t TXDAT3;

    /**
     * RXDAT
     * ===================================================================================================
     * Offset: 0x14  PS/2 Receive DATA Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |DAT       |Received Data
     * |        |          |For host to device communication, after acknowledge bit is sent, the received data is copied from receive shift register to PS2_RXDAT register.
     * |        |          |CPU must read this register before next byte reception complete; otherwise, the data will be overwritten and RXOV(PS2_STATUS[6]) bit will be set to 1.
    */
    __I  uint32_t RXDAT;

    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x18  PS/2 Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CLKSTAT   |CLK Pin State
     * |        |          |This bit reflects the status of the CLKSTAT line after synchronizing.
     * |[1]     |DATSTAT   |DATA Pin State
     * |        |          |This bit reflects the status of the DATSTAT line after synchronizing and sampling.
     * |[2]     |FRAMEERR  |Frame Error
     * |        |          |For host to device communication, if STOP bit (logic 1) is not received it is a frame error.
     * |        |          |If frame error occurs, DATA line may keep at low state after 12th clock.
     * |        |          |At this moment, software overrides CLKSTAT to send clock till DATSTAT release to high state.
     * |        |          |After that, device sends a "Resend" command to host.
     * |        |          |0 = No frame error.
     * |        |          |1 = Frame error occurred .
     * |        |          |Note: Write 1 to clear this bit.
     * |[3]     |RXPARITY  |Received Parity
     * |        |          |This bit reflects the parity bit for the last received data byte (odd parity).
     * |        |          |Note: This bit is read only.
     * |[4]     |RXBUSY    |Receive Busy
     * |        |          |This bit indicates that the PS/2 device is currently receiving data.
     * |        |          |0 = Idle.
     * |        |          |1 = Currently receiving data.
     * |        |          |Note: This bit is read only.
     * |[5]     |TXBUSY    |Transmit Busy
     * |        |          |This bit indicates that the PS/2 device is currently sending data.
     * |        |          |0 = Idle.
     * |        |          |1 = Currently sending data.
     * |        |          |Note: This bit is read only.
     * |[6]     |RXOV      |RX Buffer Overwrite
     * |        |          |0 = No overwrite.
     * |        |          |1 = Data in PS2_RXDAT register is overwritten by new received data.
     * |        |          |Note: Write 1 to clear this bit.
     * |[7]     |TXEMPTY   |TX FIFO Empty
     * |        |          |When software writes any data to PS2_TXDAT0-3 the TXEMPTY bit is cleared to 0 immediately if PS2EN is enabled.
     * |        |          |When transmitted data byte number is equal to FIFODEPTH then TXEMPTY bit is set to 1.
     * |        |          |0 = There is data to be transmitted.
     * |        |          |1 = FIFO is empty.
     * |        |          |Note: This bit is read only.
     * |[8:11]  |BYTEIDX   |Byte Index
     * |        |          |It indicates which data byte in transmit data shift register.
     * |        |          |When all data in FIFO is transmitted and it will be cleared to 0.
     * |        |          |Note: This bit is read only.
     * |        |          |BYTEIDX        DATA Transmit
     * |        |          |0000           TXDATA0[7:0]
     * |        |          |0001           TXDATA0[15:8]
     * |        |          |0010           TXDATA0[23:16]
     * |        |          |0011           TXDATA0[31:24]
     * |        |          |0100           TXDATA1[7:0]
     * |        |          |0101           TXDATA1[15:8]
     * |        |          |0110           TXDATA1[23:16]
     * |        |          |0111           TXDATA1[31:24]
     * |        |          |1000           TXDATA2[7:0]
     * |        |          |1001           TXDATA2[15:8]
     * |        |          |1010           TXDATA2[23:16]
     * |        |          |1011           TXDATA2[31:24]
     * |        |          |1100           TXDATA3[7:0]
     * |        |          |1101           TXDATA3[15:8]
     * |        |          |1110           TXDATA3[23:16]
     * |        |          |1111           TXDATA3[31:24]
    */
    __IO uint32_t STATUS;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x1C  PS/2 Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |RXIF      |Receive Interrupt
     * |        |          |This bit is set to 1 when acknowledge bit is sent for Host to device communication.
     * |        |          |Interrupt occurs if RXIEN(PS2_CTL[2]) bit is set to 1.
     * |        |          |0 = No interrupt.
     * |        |          |1 = Receive interrupt occurred.
     * |        |          |Note: Write 1 to clear this bit to 0.
     * |[1]     |TXIF      |Transmit Interrupt
     * |        |          |This bit is set to 1 after STOP bit is transmitted. Interrupt occurs if TXIEN(PS2_CTL[1]) bit is set
     * |        |          |to 1.
     * |        |          |0 = No interrupt.
     * |        |          |1 = Transmit interrupt occurred.
     * |        |          |Note: Write 1 to clear this bit to 0.
    */
    __IO uint32_t INTSTS;

} PS2_T;

/**
    @addtogroup PS2_CONST PS2 Bit Field Definition
    Constant Definitions for PS2 Controller
@{ */

#define PS2_CTL_PS2EN_Pos                (0)                                               /*!< PS2_T::CTL: PS2EN Position                */
#define PS2_CTL_PS2EN_Msk                (0x1ul << PS2_CTL_PS2EN_Pos)                      /*!< PS2_T::CTL: PS2EN Mask                    */

#define PS2_CTL_TXIEN_Pos                (1)                                               /*!< PS2_T::CTL: TXIEN Position                */
#define PS2_CTL_TXIEN_Msk                (0x1ul << PS2_CTL_TXIEN_Pos)                      /*!< PS2_T::CTL: TXIEN Mask                    */

#define PS2_CTL_RXIEN_Pos                (2)                                               /*!< PS2_T::CTL: RXIEN Position                */
#define PS2_CTL_RXIEN_Msk                (0x1ul << PS2_CTL_RXIEN_Pos)                      /*!< PS2_T::CTL: RXIEN Mask                    */

#define PS2_CTL_TXFDEPTH_Pos             (3)                                               /*!< PS2_T::CTL: TXFDEPTH Position             */
#define PS2_CTL_TXFDEPTH_Msk             (0xful << PS2_CTL_TXFDEPTH_Pos)                   /*!< PS2_T::CTL: TXFDEPTH Mask                 */

