MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define PS2_CTL_ACK_Pos                  (7)                                               /*!< PS2_T::CTL: ACK Position                  */
#define PS2_CTL_ACK_Msk                  (0x1ul << PS2_CTL_ACK_Pos)                        /*!< PS2_T::CTL: ACK Mask                      */

#define PS2_CTL_CLRFIFO_Pos              (8)                                               /*!< PS2_T::CTL: CLRFIFO Position              */
#define PS2_CTL_CLRFIFO_Msk              (0x1ul << PS2_CTL_CLRFIFO_Pos)                    /*!< PS2_T::CTL: CLRFIFO Mask                  */

#define PS2_CTL_OVERRIDE_Pos             (9)                                               /*!< PS2_T::CTL: OVERRIDE Position             */
#define PS2_CTL_OVERRIDE_Msk             (0x1ul << PS2_CTL_OVERRIDE_Pos)                   /*!< PS2_T::CTL: OVERRIDE Mask                 */

#define PS2_CTL_FPS2CLK_Pos              (10)                                              /*!< PS2_T::CTL: FPS2CLK Position              */
#define PS2_CTL_FPS2CLK_Msk              (0x1ul << PS2_CTL_FPS2CLK_Pos)                    /*!< PS2_T::CTL: FPS2CLK Mask                  */

#define PS2_CTL_FPS2DAT_Pos              (11)                                              /*!< PS2_T::CTL: FPS2DAT Position              */
#define PS2_CTL_FPS2DAT_Msk              (0x1ul << PS2_CTL_FPS2DAT_Pos)                    /*!< PS2_T::CTL: FPS2DAT Mask                  */

#define PS2_TXDAT0_DAT_Pos               (0)                                               /*!< PS2_T::TXDAT0: DAT Position               */
#define PS2_TXDAT0_DAT_Msk               (0xfffffffful << PS2_TXDAT0_DAT_Pos)              /*!< PS2_T::TXDAT0: DAT Mask                   */

#define PS2_TXDAT1_DAT_Pos               (0)                                               /*!< PS2_T::TXDAT1: DAT Position               */
#define PS2_TXDAT1_DAT_Msk               (0xfffffffful << PS2_TXDAT1_DAT_Pos)              /*!< PS2_T::TXDAT1: DAT Mask                   */

#define PS2_TXDAT2_DAT_Pos               (0)                                               /*!< PS2_T::TXDAT2: DAT Position               */
#define PS2_TXDAT2_DAT_Msk               (0xfffffffful << PS2_TXDAT2_DAT_Pos)              /*!< PS2_T::TXDAT2: DAT Mask                   */

#define PS2_TXDAT3_DAT_Pos               (0)                                               /*!< PS2_T::TXDAT3: DAT Position               */
#define PS2_TXDAT3_DAT_Msk               (0xfffffffful << PS2_TXDAT3_DAT_Pos)              /*!< PS2_T::TXDAT3: DAT Mask                   */

#define PS2_RXDAT_DAT_Pos                (0)                                               /*!< PS2_T::RXDAT: DAT Position                */
#define PS2_RXDAT_DAT_Msk                (0xfful << PS2_RXDAT_DAT_Pos)                     /*!< PS2_T::RXDAT: DAT Mask                    */

#define PS2_STATUS_CLKSTAT_Pos           (0)                                               /*!< PS2_T::STATUS: CLKSTAT Position           */
#define PS2_STATUS_CLKSTAT_Msk           (0x1ul << PS2_STATUS_CLKSTAT_Pos)                 /*!< PS2_T::STATUS: CLKSTAT Mask               */

#define PS2_STATUS_DATSTAT_Pos           (1)                                               /*!< PS2_T::STATUS: DATSTAT Position           */
#define PS2_STATUS_DATSTAT_Msk           (0x1ul << PS2_STATUS_DATSTAT_Pos)                 /*!< PS2_T::STATUS: DATSTAT Mask               */

#define PS2_STATUS_FRAMEERR_Pos          (2)                                               /*!< PS2_T::STATUS: FRAMEERR Position          */
#define PS2_STATUS_FRAMEERR_Msk          (0x1ul << PS2_STATUS_FRAMEERR_Pos)                /*!< PS2_T::STATUS: FRAMEERR Mask              */

#define PS2_STATUS_RXPARITY_Pos          (3)                                               /*!< PS2_T::STATUS: RXPARITY Position          */
#define PS2_STATUS_RXPARITY_Msk          (0x1ul << PS2_STATUS_RXPARITY_Pos)                /*!< PS2_T::STATUS: RXPARITY Mask              */

#define PS2_STATUS_RXBUSY_Pos            (4)                                               /*!< PS2_T::STATUS: RXBUSY Position            */
#define PS2_STATUS_RXBUSY_Msk            (0x1ul << PS2_STATUS_RXBUSY_Pos)                  /*!< PS2_T::STATUS: RXBUSY Mask                */

#define PS2_STATUS_TXBUSY_Pos            (5)                                               /*!< PS2_T::STATUS: TXBUSY Position            */
#define PS2_STATUS_TXBUSY_Msk            (0x1ul << PS2_STATUS_TXBUSY_Pos)                  /*!< PS2_T::STATUS: TXBUSY Mask                */

#define PS2_STATUS_RXOV_Pos              (6)                                               /*!< PS2_T::STATUS: RXOV Position              */
#define PS2_STATUS_RXOV_Msk              (0x1ul << PS2_STATUS_RXOV_Pos)                    /*!< PS2_T::STATUS: RXOV Mask                  */

#define PS2_STATUS_TXEMPTY_Pos           (7)                                               /*!< PS2_T::STATUS: TXEMPTY Position           */
#define PS2_STATUS_TXEMPTY_Msk           (0x1ul << PS2_STATUS_TXEMPTY_Pos)                 /*!< PS2_T::STATUS: TXEMPTY Mask               */

#define PS2_STATUS_BYTEIDX_Pos           (8)                                               /*!< PS2_T::STATUS: BYTEIDX Position           */
#define PS2_STATUS_BYTEIDX_Msk           (0xful << PS2_STATUS_BYTEIDX_Pos)                 /*!< PS2_T::STATUS: BYTEIDX Mask               */

#define PS2_INTSTS_RXIF_Pos              (0)                                               /*!< PS2_T::INTSTS: RXIF Position              */
#define PS2_INTSTS_RXIF_Msk              (0x1ul << PS2_INTSTS_RXIF_Pos)                    /*!< PS2_T::INTSTS: RXIF Mask                  */

#define PS2_INTSTS_TXIF_Pos              (1)                                               /*!< PS2_T::INTSTS: TXIF Position              */
#define PS2_INTSTS_TXIF_Msk              (0x1ul << PS2_INTSTS_TXIF_Pos)                    /*!< PS2_T::INTSTS: TXIF Mask                  */

/**@}*/ /* PS2_CONST */
/**@}*/ /* end of PS2 register group */


/*---------------------- Pulse Width Modulation Controller -------------------------*/
/**
    @addtogroup PWM Pulse Width Modulation Controller(PWM)
    Memory Mapped Structure for PWM Controller
@{ */

