MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define PWM_CLKPSC_CLKPSC23_Pos          (8)                                               /*!< PWM_T::CLKPSC: CLKPSC23 Position          */
#define PWM_CLKPSC_CLKPSC23_Msk          (0xfful << PWM_CLKPSC_CLKPSC23_Pos)               /*!< PWM_T::CLKPSC: CLKPSC23 Mask              */

#define PWM_CLKPSC_CLKPSC45_Pos          (16)                                              /*!< PWM_T::CLKPSC: CLKPSC45 Position          */
#define PWM_CLKPSC_CLKPSC45_Msk          (0xfful << PWM_CLKPSC_CLKPSC45_Pos)               /*!< PWM_T::CLKPSC: CLKPSC45 Mask              */

#define PWM_CLKDIV_CLKDIV0_Pos           (0)                                               /*!< PWM_T::CLKDIV: CLKDIV0 Position           */
#define PWM_CLKDIV_CLKDIV0_Msk           (0x7ul << PWM_CLKDIV_CLKDIV0_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV0 Mask               */

#define PWM_CLKDIV_CLKDIV1_Pos           (4)                                               /*!< PWM_T::CLKDIV: CLKDIV1 Position           */
#define PWM_CLKDIV_CLKDIV1_Msk           (0x7ul << PWM_CLKDIV_CLKDIV1_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV1 Mask               */

#define PWM_CLKDIV_CLKDIV2_Pos           (8)                                               /*!< PWM_T::CLKDIV: CLKDIV2 Position           */
#define PWM_CLKDIV_CLKDIV2_Msk           (0x7ul << PWM_CLKDIV_CLKDIV2_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV2 Mask               */

#define PWM_CLKDIV_CLKDIV3_Pos           (12)                                              /*!< PWM_T::CLKDIV: CLKDIV3 Position           */
#define PWM_CLKDIV_CLKDIV3_Msk           (0x7ul << PWM_CLKDIV_CLKDIV3_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV3 Mask               */

#define PWM_CLKDIV_CLKDIV4_Pos           (16)                                              /*!< PWM_T::CLKDIV: CLKDIV4 Position           */
#define PWM_CLKDIV_CLKDIV4_Msk           (0x7ul << PWM_CLKDIV_CLKDIV4_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV4 Mask               */

#define PWM_CLKDIV_CLKDIV5_Pos           (20)                                              /*!< PWM_T::CLKDIV: CLKDIV5 Position           */
#define PWM_CLKDIV_CLKDIV5_Msk           (0x7ul << PWM_CLKDIV_CLKDIV5_Pos)                 /*!< PWM_T::CLKDIV: CLKDIV5 Mask               */

#define PWM_CTL_CMPINV_Pos               (0)                                               /*!< PWM_T::CTL: CMPINV Position               */
#define PWM_CTL_CMPINV_Msk               (0x3ful << PWM_CTL_CMPINV_Pos)                    /*!< PWM_T::CTL: CMPINV Mask                   */

#define PWM_CTL_OUTMODE_Pos              (6)                                               /*!< PWM_T::CTL: OUTMODE Position              */
#define PWM_CTL_OUTMODE_Msk              (0x1ul << PWM_CTL_OUTMODE_Pos)                    /*!< PWM_T::CTL: OUTMODE Mask                  */

#define PWM_CTL_GROUPEN_Pos              (7)                                               /*!< PWM_T::CTL: GROUPEN Position              */
#define PWM_CTL_GROUPEN_Msk              (0x1ul << PWM_CTL_GROUPEN_Pos)                    /*!< PWM_T::CTL: GROUPEN Mask                  */

#define PWM_CTL_PINV_Pos                 (8)                                               /*!< PWM_T::CTL: PINV Position                 */
#define PWM_CTL_PINV_Msk                 (0x3ful << PWM_CTL_PINV_Pos)                      /*!< PWM_T::CTL: PINV Mask                     */

#define PWM_CTL_SYNCEN_Pos               (15)                                              /*!< PWM_T::CTL: SYNCEN Position               */
#define PWM_CTL_SYNCEN_Msk               (0x1ul << PWM_CTL_SYNCEN_Pos)                     /*!< PWM_T::CTL: SYNCEN Mask                   */

#define PWM_CTL_CNTMODE_Pos              (16)                                              /*!< PWM_T::CTL: CNTMODE Position              */
#define PWM_CTL_CNTMODE_Msk              (0x3ful << PWM_CTL_CNTMODE_Pos)                   /*!< PWM_T::CTL: CNTMODE Mask                  */

#define PWM_CTL_CNTTYPE_Pos              (24)                                              /*!< PWM_T::CTL: CNTTYPE Position              */
#define PWM_CTL_CNTTYPE_Msk              (0x3ful << PWM_CTL_CNTTYPE_Pos)                   /*!< PWM_T::CTL: CNTTYPE Mask                  */

#define PWM_CTL_DBGTRIOFF_Pos            (31)                                              /*!< PWM_T::CTL: DBGTRIOFF Position            */
#define PWM_CTL_DBGTRIOFF_Msk            (0x1ul << PWM_CTL_DBGTRIOFF_Pos)                  /*!< PWM_T::CTL: DBGTRIOFF Mask                */

#define PWM_CNTEN_CNTEN_Pos              (0)                                               /*!< PWM_T::CNTEN: CNTEN Position              */
#define PWM_CNTEN_CNTEN_Msk              (0x3ful << PWM_CNTEN_CNTEN_Pos)                   /*!< PWM_T::CNTEN: CNTEN Mask                  */

#define PWM_PERIOD0_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD0_PERIOD_Msk           (0xfffful << PWM_PERIOD0_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

#define PWM_PERIOD1_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD1_PERIOD_Msk           (0xfffful << PWM_PERIOD1_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

#define PWM_PERIOD2_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD2_PERIOD_Msk           (0xfffful << PWM_PERIOD2_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

#define PWM_PERIOD3_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD3_PERIOD_Msk           (0xfffful << PWM_PERIOD3_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

#define PWM_PERIOD4_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD4_PERIOD_Msk           (0xfffful << PWM_PERIOD4_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

#define PWM_PERIOD5_PERIOD_Pos           (0)                                               /*!< PWM_T::PERIOD: PERIOD Position           */
#define PWM_PERIOD5_PERIOD_Msk           (0xfffful << PWM_PERIOD5_PERIOD_Pos)              /*!< PWM_T::PERIOD: PERIOD Mask               */

