MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define PWM_CMPDAT0_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT0_CMP_Msk              (0xfffful << PWM_CMPDAT0_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CMPDAT1_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT1_CMP_Msk              (0xfffful << PWM_CMPDAT1_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CMPDAT2_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT2_CMP_Msk              (0xfffful << PWM_CMPDAT2_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CMPDAT3_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT3_CMP_Msk              (0xfffful << PWM_CMPDAT3_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CMPDAT4_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT4_CMP_Msk              (0xfffful << PWM_CMPDAT4_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CMPDAT5_CMP_Pos              (0)                                               /*!< PWM_T::CMPDAT: CMP Position              */
#define PWM_CMPDAT5_CMP_Msk              (0xfffful << PWM_CMPDAT5_CMP_Pos)                 /*!< PWM_T::CMPDAT: CMP Mask                  */

#define PWM_CNT0_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT0_CNT_Msk                 (0xfffful << PWM_CNT0_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_CNT1_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT1_CNT_Msk                 (0xfffful << PWM_CNT1_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_CNT2_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT2_CNT_Msk                 (0xfffful << PWM_CNT2_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_CNT3_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT3_CNT_Msk                 (0xfffful << PWM_CNT3_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_CNT4_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT4_CNT_Msk                 (0xfffful << PWM_CNT4_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_CNT5_CNT_Pos                 (0)                                               /*!< PWM_T::CNT: CNT Position                 */
#define PWM_CNT5_CNT_Msk                 (0xfffful << PWM_CNT5_CNT_Pos)                    /*!< PWM_T::CNT: CNT Mask                     */

#define PWM_MSKEN_MSKEN_Pos              (0)                                               /*!< PWM_T::MSKEN: MSKEN Position              */
#define PWM_MSKEN_MSKEN_Msk              (0x3ful << PWM_MSKEN_MSKEN_Pos)                   /*!< PWM_T::MSKEN: MSKEN Mask                  */

#define PWM_MSK_MSKDAT_Pos               (0)                                               /*!< PWM_T::MSK: MSKDAT Position               */
#define PWM_MSK_MSKDAT_Msk               (0x3ful << PWM_MSK_MSKDAT_Pos)                    /*!< PWM_T::MSK: MSKDAT Mask                   */

#define PWM_DTCTL_DTCNT01_Pos            (0)                                               /*!< PWM_T::DTCTL: DTCNT01 Position            */
#define PWM_DTCTL_DTCNT01_Msk            (0xfful << PWM_DTCTL_DTCNT01_Pos)                 /*!< PWM_T::DTCTL: DTCNT01 Mask                */

#define PWM_DTCTL_DTCNT23_Pos            (8)                                               /*!< PWM_T::DTCTL: DTCNT23 Position            */
#define PWM_DTCTL_DTCNT23_Msk            (0xfful << PWM_DTCTL_DTCNT23_Pos)                 /*!< PWM_T::DTCTL: DTCNT23 Mask                */

#define PWM_DTCTL_DTCNT45_Pos            (16)                                              /*!< PWM_T::DTCTL: DTCNT45 Position            */
#define PWM_DTCTL_DTCNT45_Msk            (0xfful << PWM_DTCTL_DTCNT45_Pos)                 /*!< PWM_T::DTCTL: DTCNT45 Mask                */

#define PWM_DTCTL_DTDIV_Pos              (24)                                              /*!< PWM_T::DTCTL: DTDIV Position              */
#define PWM_DTCTL_DTDIV_Msk              (0x3ul << PWM_DTCTL_DTDIV_Pos)                    /*!< PWM_T::DTCTL: DTDIV Mask                  */

#define PWM_DTCTL_DTEN01_Pos             (28)                                              /*!< PWM_T::DTCTL: DTEN01 Position             */
#define PWM_DTCTL_DTEN01_Msk             (0x1ul << PWM_DTCTL_DTEN01_Pos)                   /*!< PWM_T::DTCTL: DTEN01 Mask                 */

#define PWM_DTCTL_DTEN23_Pos             (29)                                              /*!< PWM_T::DTCTL: DTEN23 Position             */
#define PWM_DTCTL_DTEN23_Msk             (0x1ul << PWM_DTCTL_DTEN23_Pos)                   /*!< PWM_T::DTCTL: DTEN23 Mask                 */

#define PWM_DTCTL_DTEN45_Pos             (30)                                              /*!< PWM_T::DTCTL: DTEN45 Position             */
#define PWM_DTCTL_DTEN45_Msk             (0x1ul << PWM_DTCTL_DTEN45_Pos)                   /*!< PWM_T::DTCTL: DTEN45 Mask                 */

#define PWM_TRGADCTL_PTRGEN_Pos          (0)                                               /*!< PWM_T::TRGADCTL: PTRGEN Position          */
#define PWM_TRGADCTL_PTRGEN_Msk          (0x3ful << PWM_TRGADCTL_PTRGEN_Pos)               /*!< PWM_T::TRGADCTL: PTRGEN Mask              */

#define PWM_TRGADCTL_CTRGEN_Pos          (8)                                               /*!< PWM_T::TRGADCTL: CTRGEN Position          */
#define PWM_TRGADCTL_CTRGEN_Msk          (0x3ful << PWM_TRGADCTL_CTRGEN_Pos)               /*!< PWM_T::TRGADCTL: CTRGEN Mask              */

#define PWM_TRGADCTL_FTRGEN_Pos          (16)                                              /*!< PWM_T::TRGADCTL: FTRGEN Position          */
#define PWM_TRGADCTL_FTRGEN_Msk          (0x3ful << PWM_TRGADCTL_FTRGEN_Pos)               /*!< PWM_T::TRGADCTL: FTRGEN Mask              */

