MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define QEI_CTR_CHAINV_Pos               (12)                                              /*!< QEI_T::CTR: CHAINV Position               */
#define QEI_CTR_CHAINV_Msk               (0x1ul << QEI_CTR_CHAINV_Pos)                     /*!< QEI_T::CTR: CHAINV Mask                   */

#define QEI_CTR_CHBINV_Pos               (13)                                              /*!< QEI_T::CTR: CHBINV Position               */
#define QEI_CTR_CHBINV_Msk               (0x1ul << QEI_CTR_CHBINV_Pos)                     /*!< QEI_T::CTR: CHBINV Mask                   */

#define QEI_CTR_IDXINV_Pos               (14)                                              /*!< QEI_T::CTR: IDXINV Position               */
#define QEI_CTR_IDXINV_Msk               (0x1ul << QEI_CTR_IDXINV_Pos)                     /*!< QEI_T::CTR: IDXINV Mask                   */

#define QEI_CTR_OVUNIEN_Pos              (16)                                              /*!< QEI_T::CTR: OVUNIEN Position              */
#define QEI_CTR_OVUNIEN_Msk              (0x1ul << QEI_CTR_OVUNIEN_Pos)                    /*!< QEI_T::CTR: OVUNIEN Mask                  */

#define QEI_CTR_DIRIEN_Pos               (17)                                              /*!< QEI_T::CTR: DIRIEN Position               */
#define QEI_CTR_DIRIEN_Msk               (0x1ul << QEI_CTR_DIRIEN_Pos)                     /*!< QEI_T::CTR: DIRIEN Mask                   */

#define QEI_CTR_CMPIEN_Pos               (18)                                              /*!< QEI_T::CTR: CMPIEN Position               */
#define QEI_CTR_CMPIEN_Msk               (0x1ul << QEI_CTR_CMPIEN_Pos)                     /*!< QEI_T::CTR: CMPIEN Mask                   */

#define QEI_CTR_IDXIEN_Pos               (19)                                              /*!< QEI_T::CTR: IDXIEN Position               */
#define QEI_CTR_IDXIEN_Msk               (0x1ul << QEI_CTR_IDXIEN_Pos)                     /*!< QEI_T::CTR: IDXIEN Mask                   */

#define QEI_CTR_HOLDTMR0_Pos             (20)                                              /*!< QEI_T::CTR: HOLDTMR0 Position             */
#define QEI_CTR_HOLDTMR0_Msk             (0x1ul << QEI_CTR_HOLDTMR0_Pos)                   /*!< QEI_T::CTR: HOLDTMR0 Mask                 */

#define QEI_CTR_HOLDTMR1_Pos             (21)                                              /*!< QEI_T::CTR: HOLDTMR1 Position             */
#define QEI_CTR_HOLDTMR1_Msk             (0x1ul << QEI_CTR_HOLDTMR1_Pos)                   /*!< QEI_T::CTR: HOLDTMR1 Mask                 */

#define QEI_CTR_HOLDTMR2_Pos             (22)                                              /*!< QEI_T::CTR: HOLDTMR2 Position             */
#define QEI_CTR_HOLDTMR2_Msk             (0x1ul << QEI_CTR_HOLDTMR2_Pos)                   /*!< QEI_T::CTR: HOLDTMR2 Mask                 */

#define QEI_CTR_HOLDTMR3_Pos             (23)                                              /*!< QEI_T::CTR: HOLDTMR3 Position             */
#define QEI_CTR_HOLDTMR3_Msk             (0x1ul << QEI_CTR_HOLDTMR3_Pos)                   /*!< QEI_T::CTR: HOLDTMR3 Mask                 */

#define QEI_CTR_HOLDCNT_Pos              (24)                                              /*!< QEI_T::CTR: HOLDCNT Position              */
#define QEI_CTR_HOLDCNT_Msk              (0x1ul << QEI_CTR_HOLDCNT_Pos)                    /*!< QEI_T::CTR: HOLDCNT Mask                  */

#define QEI_CTR_IDXLATEN_Pos             (25)                                              /*!< QEI_T::CTR: IDXLATEN Position             */
#define QEI_CTR_IDXLATEN_Msk             (0x1ul << QEI_CTR_IDXLATEN_Pos)                   /*!< QEI_T::CTR: IDXLATEN Mask                 */

#define QEI_CTR_IDXRLDEN_Pos             (27)                                              /*!< QEI_T::CTR: IDXRLDEN Position             */
#define QEI_CTR_IDXRLDEN_Msk             (0x1ul << QEI_CTR_IDXRLDEN_Pos)                   /*!< QEI_T::CTR: IDXRLDEN Mask                 */

#define QEI_CTR_CMPENN_Pos               (28)                                              /*!< QEI_T::CTR: CMPENN Position               */
#define QEI_CTR_CMPENN_Msk               (0x1ul << QEI_CTR_CMPENN_Pos)                     /*!< QEI_T::CTR: CMPENN Mask                   */

#define QEI_CTR_QEIEN_Pos                (29)                                              /*!< QEI_T::CTR: QEIEN Position                */
#define QEI_CTR_QEIEN_Msk                (0x1ul << QEI_CTR_QEIEN_Pos)                      /*!< QEI_T::CTR: QEIEN Mask                    */

#define QEI_STATUS_IDXF_Pos              (0)                                               /*!< QEI_T::STATUS: IDXF Position              */
#define QEI_STATUS_IDXF_Msk              (0x1ul << QEI_STATUS_IDXF_Pos)                    /*!< QEI_T::STATUS: IDXF Mask                  */

#define QEI_STATUS_CMPF_Pos              (1)                                               /*!< QEI_T::STATUS: CMPF Position              */
#define QEI_STATUS_CMPF_Msk              (0x1ul << QEI_STATUS_CMPF_Pos)                    /*!< QEI_T::STATUS: CMPF Mask                  */

#define QEI_STATUS_OVUNF_Pos             (2)                                               /*!< QEI_T::STATUS: OVUNF Position             */
#define QEI_STATUS_OVUNF_Msk             (0x1ul << QEI_STATUS_OVUNF_Pos)                   /*!< QEI_T::STATUS: OVUNF Mask                 */

#define QEI_STATUS_DIRCHGF_Pos           (3)                                               /*!< QEI_T::STATUS: DIRCHGF Position           */
#define QEI_STATUS_DIRCHGF_Msk           (0x1ul << QEI_STATUS_DIRCHGF_Pos)                 /*!< QEI_T::STATUS: DIRCHGF Mask               */

#define QEI_STATUS_DIRF_Pos              (8)                                               /*!< QEI_T::STATUS: DIRF Position              */
#define QEI_STATUS_DIRF_Msk              (0x1ul << QEI_STATUS_DIRF_Pos)                    /*!< QEI_T::STATUS: DIRF Mask                  */

/**@}*/ /* QEI_CONST */
/**@}*/ /* end of QEI register group */


/*---------------------- Real Time Clock Controller -------------------------*/
/**
    @addtogroup RTC Real Time Clock Controller(RTC)
    Memory Mapped Structure for RTC Controller
@{ */

