MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
typedef struct {

    /**
     * INIT
     * ===================================================================================================
     * Offset: 0x00  RTC Initiation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INIT_Active|RTC Active Status (Read Only)
     * |        |          |0 = RTC is at reset state.
     * |        |          |1 = RTC is at normal active state.
     * |[1:31]  |INIT      |RTC Initiation
     * |        |          |When RTC block is powered on, RTC is at reset state.
     * |        |          |User has to write a number (0x a5eb1357) to INIT to make RTC leaving reset state.
     * |        |          |Once the INIT is written as 0xa5eb1357, the RTC will be in un-reset state permanently.
     * |        |          |The INIT is a write-only field and read value will be always "0".
    */
    __IO uint32_t INIT;

    /**
     * RWEN
     * ===================================================================================================
     * Offset: 0x04  RTC Access Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RWEN      |RTC Register Access Enable Password (Write Only)
     * |        |          |Writing 0xA965 to this register will enable RTC access and keep 1024 RTC clock.
     * |[16]    |RWENF     |RTC Register Access Enable Flag (Read Only)
     * |        |          |0 = RTC register read/write Disabled.
     * |        |          |1 = RTC register read/write Enabled.
     * |        |          |This bit will be set after RTC_RWEN[15:0] register is load a 0xA965, and be cleared automatically after 1024 RTC clock.
    */
    __O  uint32_t RWEN;

    /**
     * FREQADJ
     * ===================================================================================================
     * Offset: 0x08  RTC Frequency Compensation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |FRACTION  |Fraction Part
     * |        |          |Formula = (fraction part of detected value) x 60.
     * |        |          |Note: Digit in RTC_FREQADJ must be expressed as hexadecimal number.
     * |[8:11]  |INTEGER   |Integer Part
    */
    __IO uint32_t FREQADJ;

    /**
     * TIME
     * ===================================================================================================
     * Offset: 0x0C  Time Loading Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |SEC       |1-Sec Time Digit (0~9)
     * |[4:6]   |TENSEC    |10-Sec Time Digit (0~5)
     * |[8:11]  |MIN       |1-Min Time Digit (0~9)
     * |[12:14] |TENMIN    |10-Min Time Digit (0~5)
     * |[16:19] |HR        |1-Hour Time Digit (0~9)
     * |[20:21] |TENHR     |10-Hour Time Digit (0~2)
    */
    __IO uint32_t TIME;

    /**
     * CAL
     * ===================================================================================================
     * Offset: 0x10  Calendar Loading Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |DAY       |1-Day Calendar Digit (0~9)
     * |[4:5]   |TENDAY    |10-Day Calendar Digit (0~3)
     * |[8:11]  |MON       |1-Month Calendar Digit (0~9)
     * |[12]    |TENMON    |10-Month Calendar Digit (0~1)
     * |[16:19] |YEAR      |1-Year Calendar Digit (0~9)
     * |[20:23] |TENYEAR   |10-Year Calendar Digit (0~9)
    */
    __IO uint32_t CAL;

    /**
     * CLKFMT
     * ===================================================================================================
     * Offset: 0x14  Time Scale Selection Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |24HEN     |24-Hour / 12-Hour Time Scale Selection
     * |        |          |Indicates that RTC_TIME and RTC_TALM are in 24-hour time scale or 12-hour time scale
     * |        |          |0 = 12-hour time scale with AM and PM indication selected.
     * |        |          |1 = 24-hour time scale selected.
    */
    __IO uint32_t CLKFMT;

    /**
     * WEEKDAY
     * ===================================================================================================
     * Offset: 0x18  Day of the Week Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |WEEKDAY   |Day Of The Week Bits
     * |        |          |000 = Sunday.
     * |        |          |001 = Monday.
     * |        |          |010 = Tuesday.
     * |        |          |011 = Wednesday.
     * |        |          |100 = Thursday.
     * |        |          |101 = Friday.
     * |        |          |110 = Saturday.
     * |        |          |111 = Reserved
    */
    __IO uint32_t WEEKDAY;

    /**
     * TALM
     * ===================================================================================================
     * Offset: 0x1C  Time Alarm Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |SEC       |1-Sec Time Digit of Alarm Setting (0~9)
     * |[4:6]   |TENSEC    |10-Sec Time Digit of Alarm Setting (0~5)
     * |[8:11]  |MIN       |1-Min Time Digit of Alarm Setting (0~9)
     * |[12:14] |TENMIN    |10-Min Time Digit of Alarm Setting (0~5)
     * |[16:19] |HR        |1-Hour Time Digit of Alarm Setting (0~9)
     * |[20:21] |TENHR     |10-Hour Time Digit of Alarm Setting (0~2)
    */
    __IO uint32_t TALM;

    /**
     * CALM
     * ===================================================================================================
     * Offset: 0x20  Calendar Alarm Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |DAY       |1-Day Calendar Digit of Alarm Setting (0~9)
     * |[4:5]   |TENDAY    |10-Day Calendar Digit of Alarm Setting (0~3)
     * |[8:11]  |MON       |1-Month Calendar Digit of Alarm Setting (0~9)
     * |[12]    |TENMON    |10-Month Calendar Digit of Alarm Setting (0~1)
     * |[16:19] |YEAR      |1-Year Calendar Digit of Alarm Setting (0~9)
     * |[20:23] |TENYEAR   |10-Year Calendar Digit of Alarm Setting (0~9)
    */
    __IO uint32_t CALM;

    /**
     * LEAPYEAR
     * ===================================================================================================
     * Offset: 0x24  Leap Year Indication Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LEAPYEAR  |Leap Year Indicator (Read Only)
     * |        |          |0 = This year is not a leap year.
     * |        |          |1 = This year is leap year.
    */
    __I  uint32_t LEAPYEAR;

    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x28  RTC Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ALMIEN    |Alarm Interrupt Enable Control
     * |        |          |0 = RTC Alarm Interrupt Disabled.
     * |        |          |1 = RTC Alarm Interrupt Enabled.
     * |[1]     |TICKIEN   |Time Tick Interrupt Enable Control
     * |        |          |0 = RTC Time Tick Interrupt Disabled.
     * |        |          |1 = RTC Time Tick Interrupt Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x2C  RTC Interrupt Indicator Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ALMIF     |RTC Alarm Interrupt Flag
     * |        |          |When RTC real time counters RTC_TIME and RTC_CAL reach the alarm setting time registers RTC_TALM and RTC_CALM, this bit will be set to 1 and an interrupt will be generated if RTC Alarm Interrupt enabled (ALMIEN (RTC_INTEN(0)) is set to 1.
     * |        |          |Chip will also be waken up if RTC Alarm Interrupt is enabled and this bit is set to 1 when chip is running at Power-down mode.
     * |        |          |Note: This bit can be cleared by writing 1 to it.
     * |[1]     |TICKIF    |RTC Time Tick Interrupt Flag
     * |        |          |When RTC Time Tick happened, this bit will be set to 1 and an interrupt will be generated if RTC Tick Interrupt enabled (TICKIEN (RTC_INTEN[1])) is set to 1.
     * |        |          |Chip will also be waken up if RTC Tick Interrupt is enabled and this bit is set to 1 when chip is running at Power-down mode.
     * |        |          |Note: This bit can be cleared by writing 1 to it.
    */
    __IO uint32_t INTSTS;

    /**
     * TICK
     * ===================================================================================================
     * Offset: 0x30  RTC Time Tick Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |TICKSEL   |Time Tick Bits
     * |        |          |The RTC time tick period for Periodic Time Tick Interrupt request.
     * |        |          |000 = Time tick is 1 second.
     * |        |          |001 = Time tick is 1/2 second.
     * |        |          |010 = Time tick is 1/4 second.
     * |        |          |011 = Time tick is 1/8 second.
     * |        |          |100 = Time tick is 1/16 second.
     * |        |          |101 = Time tick is 1/32 second.
     * |        |          |110 = Time tick is 1/64 second.
     * |        |          |111 = Time tick is 1/128 second.
     * |        |          |Note: These bits can be read back after the RTC register access enable bit RWENF (RTC_RWEN[16]) is active.
    */
    __IO uint32_t TICK;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[2];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SPRCTL
     * ===================================================================================================
     * Offset: 0x3C  RTC Spare Functional Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2]     |SPRRWEN   |SPR Register Enable Control
     * |        |          |This bit controls the spare register to be enabled or not.
     * |        |          |0 = Spare register Disabled and RTC_SPR0 ~ RTC_SPR23 cannot be accessed.
     * |        |          |1 = Spare register Enabled and RTC_SPR0 ~ RTC_SPR23 can be accessed.
     * |[7]     |SPRRWRDY  |SPR Register Ready
     * |        |          |This bit indicates if the registers RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR23 are ready to be accessed.
     * |        |          |After CPU writing registers RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR23, polling this bit to check if these registers are updated done is necessary.
     * |        |          |This bit is read only and any write to it won't take any effect.
     * |        |          |0 = RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR23 updating is in progress.
     * |        |          |1 = RTC_SPRCTL, RTC_SPR0 ~ RTC_SPR23 are updated done and ready to be accessed.
    */
    __IO uint32_t SPRCTL;

    /**
     * SPRx
     * ===================================================================================================
     * Offset: 0x40  RTC Spare Register 0 ~ 23
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |SPARE     |SPARE Bits
     * |        |          |This field is used to store back-up information defined by software.
     * |        |          |This field will be cleared by hardware automatically once a snooper pin event is detected.
     * |        |          |Before storing back-up information in to SPARE register, software should write 0xA965 to RTC_RWEN to make sure register read/write enabled.
    */
    __IO uint32_t SPR[24];
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[28];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TAMPCTL
     * ===================================================================================================
     * Offset: 0x110  Tamper Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TIEN      |Tamper Interrupt Enable Control
     * |        |          |0 = Tamper interrupt Disabled.
     * |        |          |1 = Tamper interrupt Enabled.
     * |[1]     |DESTROYEN |Destroy Spare Register Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[2]     |TAMPEN0   |Tamper0 Detect Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[3]     |TAMPEN1   |Tamper1 Detect Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[4]     |TAMPDBEN0 |Tamper0 De-Bounce Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[5]     |TAMPDBEN1 |Tamper1 De-Bounce Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[6]     |TAMPLV0   |Tamper0 Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
     * |[7]     |TAMPLV1   |Tamper1 Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
    */
    __IO uint32_t TAMPCTL;

    /**
     * TAMPSTS
     * ===================================================================================================
     * Offset: 0x114  Tamper Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |TAMPSTS0  |Tamper0 Sense Flag
     * |        |          |0 = No invasion.
     * |        |          |1 = Tamper0 detect invasion.
     * |        |          |Note: Write 1 to clear it
     * |[1]     |TAMPSTS1  |Tamper1 Sense Flag
     * |        |          |0 = No invasion.
     * |        |          |1 = Tamper1 detect invasion.
     * |        |          |Note: Write 1 to clear it
    */
    __IO uint32_t TAMPSTS;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TAMP0PCTL
     * ===================================================================================================
     * Offset: 0x124  TAMPER0 Pin I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OUTLV     |Output Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
     * |[1]     |OUTEN     |Output Enable Control
     * |        |          |0 = Output Enabled.
     * |        |          |1 = Output Disabled.
     * |[2]     |TRIEN     |Tri-State
     * |        |          |0 = Tri-state Disabled.
     * |        |          |1 = Tri-state Enabled.
     * |[3]     |TYPE      |Type
     * |        |          |0 = Input Schmitt Trigger function Disabled.
     * |        |          |1 = Input Schmitt Trigger function Enabled.
     * |[4]     |DINOFF    |Off Digital
     * |        |          |0 = Off digital Disabled.
     * |        |          |1 = Off digital Enabled.
    */
    __IO uint32_t TAMP0PCTL;

    /**
     * TAMP1PCTL
     * ===================================================================================================
     * Offset: 0x128  TAMPER1 Pin I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OUTLV     |Output Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
     * |[1]     |OUTEN     |Output Enable Control
     * |        |          |0 = Output Enabled.
     * |        |          |1 = Output Disabled.
     * |[2]     |TRIEN     |Tri-State
     * |        |          |0 = Tri-state Disabled.
     * |        |          |1 = Tri-state Enabled.
     * |[3]     |TYPE      |Type
     * |        |          |0 = Input Schmitt Trigger function Disabled.
     * |        |          |1 = Input Schmitt Trigger function Enabled.
     * |[4]     |DINOFF    |Off Digital
     * |        |          |0 = Off digital Disabled.
     * |        |          |1 = Off digital Enabled.
    */
    __IO uint32_t TAMP1PCTL;

    /**
     * LXTIPCTL
     * ===================================================================================================
     * Offset: 0x12C  32K Input Pin I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OUTLV     |Output Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
     * |[1]     |OUTEN     |Output Enable Control
     * |        |          |0 = Output Enabled.
     * |        |          |1 = Output Disabled.
     * |[2]     |TRIEN     |Tri-State
     * |        |          |0 = Tri-state Disabled.
     * |        |          |1 = Tri-state Enabled.
     * |[3]     |TYPE      |Type
     * |        |          |0 = Input Schmitt Trigger function Disabled.
     * |        |          |1 = Input Schmitt Trigger function Enabled.
     * |[4]     |DINOFF    |Off Digital
     * |        |          |0 = Off digital Disabled.
     * |        |          |1 = Off digital Enabled.
    */
    __IO uint32_t LXTIPCTL;

    /**
     * LXTOPCTL
     * ===================================================================================================
     * Offset: 0x130  32K Output Pin I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OUTLV     |Output Level
     * |        |          |0 = Low.
     * |        |          |1 = High.
     * |[1]     |OUTEN     |Output Enable Control
     * |        |          |0 = Output Enabled.
     * |        |          |1 = Output Disabled.
     * |[2]     |TRIEN     |Tri-State
     * |        |          |0 = Tri-state Disabled.
     * |        |          |1 = Tri-state Enabled.
     * |[3]     |TYPE      |Type
     * |        |          |0 = Input Schmitt Trigger function Disabled.
     * |        |          |1 = Input Schmitt Trigger function Enabled.
     * |[4]     |DINOFF    |Off Digital
     * |        |          |0 = Off digital Disabled.
     * |        |          |1 = Off digital Enabled.
    */
    __IO uint32_t LXTOPCTL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE3[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * TAMSK
     * ===================================================================================================
     * Offset: 0x140  Time Alarm MASK Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |MSEC      |Mask 1-Sec Time Digit of Alarm Setting (0~9)
     * |[1]     |MTENSEC   |Mask 10-Sec Time Digit of Alarm Setting (0~5)
     * |[2]     |MMIN      |Mask 1-Min Time Digit of Alarm Setting (0~9)
     * |[3]     |MTENMIN   |Mask 10-Min Time Digit of Alarm Setting (0~5)
     * |[4]     |MHR       |Mask 1-Hour Time Digit of Alarm Setting (0~9)
     * |[5]     |MTENHR    |Mask 10-Hour Time Digit of Alarm Setting (0~2)
    */
    __IO uint32_t TAMSK;

    /**
     * CAMSK
     * ===================================================================================================
     * Offset: 0x144  Calendar Alarm MASK Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |MDAY      |Mask 1-Day Calendar Digit of Alarm Setting (0~9)
     * |[1]     |MTENDAY   |Mask 10-Day Calendar Digit of Alarm Setting (0~3)
     * |[2]     |MMON      |Mask 1-Month Calendar Digit of Alarm Setting (0~9)
     * |[3]     |MTENMON   |Mask 10-Month Calendar Digit of Alarm Setting (0~1)
     * |[4]     |MYEAR     |Mask 1-Year Calendar Digit of Alarm Setting (0~9)
     * |[5]     |MTENYEAR  |Mask 10-Year Calendar Digit of Alarm Setting (0~9)
    */
    __IO uint32_t CAMSK;

} RTC_T;

/**
    @addtogroup RTC_CONST RTC Bit Field Definition
    Constant Definitions for RTC Controller
@{ */

#define RTC_INIT_INIT_Active_Pos         (0)                                               /*!< RTC_T::INIT: INIT_Active Position         */
#define RTC_INIT_INIT_Active_Msk         (0x1ul << RTC_INIT_INIT_Active_Pos)               /*!< RTC_T::INIT: INIT_Active Mask             */

#define RTC_INIT_INIT_Pos                (1)                                               /*!< RTC_T::INIT: INIT Position                */
#define RTC_INIT_INIT_Msk                (0x7ffffffful << RTC_INIT_INIT_Pos)               /*!< RTC_T::INIT: INIT Mask                    */

#define RTC_RWEN_RWEN_Pos                (0)                                               /*!< RTC_T::RWEN: RWEN Position                */
#define RTC_RWEN_RWEN_Msk                (0xfffful << RTC_RWEN_RWEN_Pos)                   /*!< RTC_T::RWEN: RWEN Mask                    */

#define RTC_RWEN_RWENF_Pos               (16)                                              /*!< RTC_T::RWEN: RWENF Position               */
#define RTC_RWEN_RWENF_Msk               (0x1ul << RTC_RWEN_RWENF_Pos)                     /*!< RTC_T::RWEN: RWENF Mask                   */

#define RTC_FREQADJ_FRACTION_Pos         (0)                                               /*!< RTC_T::FREQADJ: FRACTION Position         */
#define RTC_FREQADJ_FRACTION_Msk         (0x3ful << RTC_FREQADJ_FRACTION_Pos)              /*!< RTC_T::FREQADJ: FRACTION Mask             */

