MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
#define RTC_LEAPYEAR_LEAPYEAR_Pos        (0)                                               /*!< RTC_T::LEAPYEAR: LEAPYEAR Position        */
#define RTC_LEAPYEAR_LEAPYEAR_Msk        (0x1ul << RTC_LEAPYEAR_LEAPYEAR_Pos)              /*!< RTC_T::LEAPYEAR: LEAPYEAR Mask            */

#define RTC_INTEN_ALMIEN_Pos             (0)                                               /*!< RTC_T::INTEN: ALMIEN Position             */
#define RTC_INTEN_ALMIEN_Msk             (0x1ul << RTC_INTEN_ALMIEN_Pos)                   /*!< RTC_T::INTEN: ALMIEN Mask                 */

#define RTC_INTEN_TICKIEN_Pos            (1)                                               /*!< RTC_T::INTEN: TICKIEN Position            */
#define RTC_INTEN_TICKIEN_Msk            (0x1ul << RTC_INTEN_TICKIEN_Pos)                  /*!< RTC_T::INTEN: TICKIEN Mask                */

#define RTC_INTSTS_ALMIF_Pos             (0)                                               /*!< RTC_T::INTSTS: ALMIF Position             */
#define RTC_INTSTS_ALMIF_Msk             (0x1ul << RTC_INTSTS_ALMIF_Pos)                   /*!< RTC_T::INTSTS: ALMIF Mask                 */

#define RTC_INTSTS_TICKIF_Pos            (1)                                               /*!< RTC_T::INTSTS: TICKIF Position            */
#define RTC_INTSTS_TICKIF_Msk            (0x1ul << RTC_INTSTS_TICKIF_Pos)                  /*!< RTC_T::INTSTS: TICKIF Mask                */

#define RTC_TICK_TICKSEL_Pos             (0)                                               /*!< RTC_T::TICK: TICKSEL Position             */
#define RTC_TICK_TICKSEL_Msk             (0x7ul << RTC_TICK_TICKSEL_Pos)                   /*!< RTC_T::TICK: TICKSEL Mask                 */

#define RTC_SPRCTL_SPRRWEN_Pos           (2)                                               /*!< RTC_T::SPRCTL: SPRRWEN Position           */
#define RTC_SPRCTL_SPRRWEN_Msk           (0x1ul << RTC_SPRCTL_SPRRWEN_Pos)                 /*!< RTC_T::SPRCTL: SPRRWEN Mask               */

#define RTC_SPRCTL_SPRRWRDY_Pos          (7)                                               /*!< RTC_T::SPRCTL: SPRRWRDY Position          */
#define RTC_SPRCTL_SPRRWRDY_Msk          (0x1ul << RTC_SPRCTL_SPRRWRDY_Pos)                /*!< RTC_T::SPRCTL: SPRRWRDY Mask              */

#define RTC_TAMPCTL_TIEN_Pos             (0)                                               /*!< RTC_T::TAMPCTL: TIEN Position             */
#define RTC_TAMPCTL_TIEN_Msk             (0x1ul << RTC_TAMPCTL_TIEN_Pos)                   /*!< RTC_T::TAMPCTL: TIEN Mask                 */

#define RTC_TAMPCTL_DESTROYEN_Pos        (1)                                               /*!< RTC_T::TAMPCTL: DESTROYEN Position        */
#define RTC_TAMPCTL_DESTROYEN_Msk        (0x1ul << RTC_TAMPCTL_DESTROYEN_Pos)              /*!< RTC_T::TAMPCTL: DESTROYEN Mask            */

#define RTC_TAMPCTL_TAMPEN0_Pos          (2)                                               /*!< RTC_T::TAMPCTL: TAMPEN0 Position          */
#define RTC_TAMPCTL_TAMPEN0_Msk          (0x1ul << RTC_TAMPCTL_TAMPEN0_Pos)                /*!< RTC_T::TAMPCTL: TAMPEN0 Mask              */

#define RTC_TAMPCTL_TAMPEN1_Pos          (3)                                               /*!< RTC_T::TAMPCTL: TAMPEN1 Position          */
#define RTC_TAMPCTL_TAMPEN1_Msk          (0x1ul << RTC_TAMPCTL_TAMPEN1_Pos)                /*!< RTC_T::TAMPCTL: TAMPEN1 Mask              */

#define RTC_TAMPCTL_TAMPDBEN0_Pos        (4)                                               /*!< RTC_T::TAMPCTL: TAMPDBEN0 Position        */
#define RTC_TAMPCTL_TAMPDBEN0_Msk        (0x1ul << RTC_TAMPCTL_TAMPDBEN0_Pos)              /*!< RTC_T::TAMPCTL: TAMPDBEN0 Mask            */

#define RTC_TAMPCTL_TAMPDBEN1_Pos        (5)                                               /*!< RTC_T::TAMPCTL: TAMPDBEN1 Position        */
#define RTC_TAMPCTL_TAMPDBEN1_Msk        (0x1ul << RTC_TAMPCTL_TAMPDBEN1_Pos)              /*!< RTC_T::TAMPCTL: TAMPDBEN1 Mask            */

#define RTC_TAMPCTL_TAMPLV0_Pos          (6)                                               /*!< RTC_T::TAMPCTL: TAMPLV0 Position          */
#define RTC_TAMPCTL_TAMPLV0_Msk          (0x1ul << RTC_TAMPCTL_TAMPLV0_Pos)                /*!< RTC_T::TAMPCTL: TAMPLV0 Mask              */

#define RTC_TAMPCTL_TAMPLV1_Pos          (7)                                               /*!< RTC_T::TAMPCTL: TAMPLV1 Position          */
#define RTC_TAMPCTL_TAMPLV1_Msk          (0x1ul << RTC_TAMPCTL_TAMPLV1_Pos)                /*!< RTC_T::TAMPCTL: TAMPLV1 Mask              */

#define RTC_TAMPSTS_TAMPSTS0_Pos         (0)                                               /*!< RTC_T::TAMPSTS: TAMPSTS0 Position         */
#define RTC_TAMPSTS_TAMPSTS0_Msk         (0x1ul << RTC_TAMPSTS_TAMPSTS0_Pos)               /*!< RTC_T::TAMPSTS: TAMPSTS0 Mask             */

#define RTC_TAMPSTS_TAMPSTS1_Pos         (1)                                               /*!< RTC_T::TAMPSTS: TAMPSTS1 Position         */
#define RTC_TAMPSTS_TAMPSTS1_Msk         (0x1ul << RTC_TAMPSTS_TAMPSTS1_Pos)               /*!< RTC_T::TAMPSTS: TAMPSTS1 Mask             */

#define RTC_TAMP0PCTL_OUTLV_Pos          (0)                                               /*!< RTC_T::TAMP0PCTL: OUTLV Position          */
#define RTC_TAMP0PCTL_OUTLV_Msk          (0x1ul << RTC_TAMP0PCTL_OUTLV_Pos)                /*!< RTC_T::TAMP0PCTL: OUTLV Mask              */

#define RTC_TAMP0PCTL_OUTEN_Pos          (1)                                               /*!< RTC_T::TAMP0PCTL: OUTEN Position          */
#define RTC_TAMP0PCTL_OUTEN_Msk          (0x1ul << RTC_TAMP0PCTL_OUTEN_Pos)                /*!< RTC_T::TAMP0PCTL: OUTEN Mask              */

#define RTC_TAMP0PCTL_TRIEN_Pos          (2)                                               /*!< RTC_T::TAMP0PCTL: TRIEN Position          */
#define RTC_TAMP0PCTL_TRIEN_Msk          (0x1ul << RTC_TAMP0PCTL_TRIEN_Pos)                /*!< RTC_T::TAMP0PCTL: TRIEN Mask              */

#define RTC_TAMP0PCTL_TYPE_Pos           (3)                                               /*!< RTC_T::TAMP0PCTL: TYPE Position           */
#define RTC_TAMP0PCTL_TYPE_Msk           (0x1ul << RTC_TAMP0PCTL_TYPE_Pos)                 /*!< RTC_T::TAMP0PCTL: TYPE Mask               */

#define RTC_TAMP0PCTL_DINOFF_Pos         (4)                                               /*!< RTC_T::TAMP0PCTL: DINOFF Position         */
#define RTC_TAMP0PCTL_DINOFF_Msk         (0x1ul << RTC_TAMP0PCTL_DINOFF_Pos)               /*!< RTC_T::TAMP0PCTL: DINOFF Mask             */

