MikroElektronika/SDK-Build-Tool/ARM/gcc_clang/def/nuvoton/NUC442JI8AE/mcu.h
    /**
     * HcRhStatus
     * ===================================================================================================
     * Offset: 0x50  Host Controller Root Hub Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |LPS       |LocalPowerStatus (Read)
     * |        |          |Not Supported. Always read '0'.
     * |        |          |ClearGlobalPower (Write)
     * |        |          |Writing '1' issues a ClearGlobalPower command to the ports. Writing '0' has no effect.
     * |[1]     |OCI       |Overcurrent Indicator
     * |        |          |This bit reflects the state of the OVRCUR pin.
     * |        |          |This field is only valid if NOCP (RHDESA[12]) and OCPM (RHDESA[11]) are cleared.
     * |        |          |0 = No overcurrent condition.
     * |        |          |1 = Overcurrent condition.
     * |[15]    |DRWE      |Device Remote Wake-Up Enable Control (Read)
     * |        |          |This bit enables ports' CC (HcRhPtr[0]) as a remote wake-up event.
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |Set Remote Wake-up Enable Control (Write)
     * |        |          |Writing 1' sets DRWEn. Writing '0' has no effect.
     * |[16]    |LPSC      |Local Power Status Change (Read)
     * |        |          |Not supported. Always read '0'.
     * |        |          |SetGlobalPower (Write)
     * |        |          |Writing '1' issues a SetGlobalPower command to the ports. Writing '0' has no effect.
     * |[17]    |OCIC      |Overcurrent Indicator Change
     * |        |          |This bit is set when OC bit changes.
     * |        |          |Writing '1' clears this bit. Writing '0' has no effect.
     * |[31]    |CRWE      |Clear Remote Wake-Up Enable Control
     * |        |          |Writing '1' to this bit clears DRWEn (HcRhStatus[15]). Writing '0' has no effect.
    */
    __IO uint32_t HcRhStatus;

    /**
     * HcRhPortStatus1/HcRhPortStatus2
     * ===================================================================================================
     * Offset: 0x54,0x58  Host Controller Root Hub Port Status [1/2]
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CCS       |Current Connect Status (Read)
     * |        |          |0 = No device connected.
     * |        |          |1 = Device connected.
     * |        |          |Clear Port Enable Control (Write)
     * |        |          |Writing '1' a clears PE. Writing '0' has no effect.
     * |[1]     |PES       |Port Enable Status (Read)
     * |        |          |0 = Port Disabled.
     * |        |          |1 = Port Enabled.
     * |        |          |SetPortEnable (Write)
     * |        |          |Writing '1' sets PE. Writing '0' has no effect.
     * |[2]     |PSS       |PortSuspendStatus (Read)
     * |        |          |0 = Port is not suspended.
     * |        |          |1 = Port is selectively suspended.
     * |        |          |SetPortSuspend (Write)
     * |        |          |Writing '1' sets PortSuspendStatus. Writing '0' has no effect.
     * |[3]     |POCI      |PortOverCurrentIndicator (Read)
     * |        |          |Root Hub supports global overcurrent reporting.
     * |        |          |This bit reflects the state of the OVRCUR pin dedicated to this port.
     * |        |          |This field is only valid if NOCP (RHDESA[12]) is cleared and OCPM (RHDESA[11]) is set.
     * |        |          |0 = No overcurrent condition.
     * |        |          |1 = Overcurrent condition.
     * |        |          |ClearPortSuspend (Write)
     * |        |          |Writing '1' initiates the selective resume sequence for the port. Writing '0' has no effect.
     * |[4]     |PRS       |PortResetStatus (Read)
     * |        |          |This bit reflects the power state of the port regardless of the power switching mode.
     * |        |          |0 = Port reset signal is not active.
     * |        |          |1 = Port reset signal is active.
     * |        |          |SetPortReset (Write)
     * |        |          |Writing '1' sets PR. Writing '0' has no effect.
     * |[8]     |PPS       |PortPowerStatus (Read)
     * |        |          |This bit reflects the power state of the port regardless of the power switching mode.
     * |        |          |0 = Port power is off.
     * |        |          |1 = Port power is on.
     * |        |          |Note: If NPS (RHDESA[9]) is set, this bit is always read as '1'.
     * |        |          |SetPortPower (Write)
     * |        |          |Writing '1' sets PPS. Writing '0' has no effect.
     * |[9]     |LSDA      |LowSpeedDeviceAttached (Read)
     * |        |          |This bit defines the speed (and bud idle) of the attached device. It is only valid when CC bit is set.
     * |        |          |0 = Full Speed device.
     * |        |          |1 = Low-speed device.
     * |        |          |ClearPortPower (Write)
     * |        |          |Writing '1' clears PPS bit. Writing '0' has no effect.
     * |[16]    |CSC       |Connect Status Change
     * |        |          |This bit indicates connect or disconnect event has been detected.
     * |        |          |Writing '1' clears this bit.
     * |        |          |Writing '0' has no effect.
     * |        |          |0 = No connect/disconnect event.
     * |        |          |1 = Hardware detection of connect/disconnect event.
     * |        |          |Note: If DevRemove (HcRhDescriptorB[2:0]) is set, this bit resets to '1'.
     * |[17]    |PESC      |Port Enable Status Change
     * |        |          |This bit indicates that the port has been disabled due to a hardware event (cleared PE bit).
     * |        |          |0 = No port enable change event.
     * |        |          |1 = Port enable state has been changed.
     * |[18]    |PSSC      |Port Reset Status Change
     * |        |          |This bit indicates the completion of the selective resume sequence for the port.
     * |        |          |0 = Port is not resumed.
     * |        |          |1 = Port resume is complete.
     * |[19]    |OCIC      |Port Overcurrent Indicator Change
     * |        |          |This bit is set when OC (HcRhStatus[1]) changes. Writing '1' clears this bit. Writing '0' has no effect.
     * |[20]    |PRSC      |Port Reset Status Change
     * |        |          |This bit indicates that the port reset signal has completed.
     * |        |          |0 = Port reset is not complete.
     * |        |          |1 = Port reset is complete.
    */
    __IO uint32_t HcRhPortStatus[2];
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[105];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * HcPhyControl
     * ===================================================================================================
     * Offset: 0x200  USB PHY Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[27]    |STBYEN    |USB Transceiver Standby Enable Control
     * |        |          |This bit controls if USB 1.1 transceiver could enter the standby mode to reduce power consumption.
     * |        |          |If this bit is low, the USB 1.1 transceiver would never enter the standby mode.
     * |        |          |If this bit is high, the USB 1.1 transceiver will enter standby mode while port is in power off state (port power is inactive).
    */
    __IO uint32_t HcPhyControl;

    /**
     * HcMiscControl
     * ===================================================================================================
     * Offset: 0x204  USB Operational Mode Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DBR16     |Data Buffer Region 16
     * |        |          |When set, the size of the data buffer region is 16 bytes. Otherwise, the size is 32 bytes.
     * |[1]     |ABORT     |AHB Bus ERROR Response
     * |        |          |This bit indicates there is an ERROR response received in AHB bus.
     * |        |          |0 = No ERROR response received.
     * |        |          |1 = ERROR response received.
     * |[3]     |OCA       |Overcurrent Active Low
     * |        |          |This bit controls the polarity of overcurrent flag from external power IC.
     * |        |          |0 = Overcurrent flag is high active.
     * |        |          |1 = Overcurrent flag is low active.
     * |[4]     |PCAL      |Port Power Control Active Low
     * |        |          |This bit controls the polarity of port power control to external power IC.
     * |        |          |0 = Port power control is high active.
     * |        |          |1 = Port power control is low active.
     * |[8]     |SIEPD     |SIE Pipeline Disable Control
     * |        |          |When set, waits for all USB bus activity to complete prior to returning completion status to the List Processor.
     * |        |          |This is a fail safe mechanism to avoid potential problems with the clk_dr transition between 1.5 MHz and 12 MHz.
     * |[16]    |DPRT1     |Port 1 Disable Control
     * |        |          |This bit controls if the connection between USB host controller and transceiver of port 1 is disabled.
     * |        |          |If the connection is disabled, the USB host controller will not recognize any event of USB bus.
     * |        |          |Set this bit high, the transceiver of port 1 will also be forced into the standby mode no matter what USB host controller operation is.
     * |        |          |0 = The connection between USB host controller and transceiver of port 1 is enabled.
     * |        |          |1 = The connection between USB host controller and transceiver of port 1 is disabled and the transceiver of port 1 will also be forced into the standby mode.
     * |[17]    |DPRT2     |Port 2 Disable Control
     * |        |          |This bit controls if the connection between USB host controller and transceiver of port 2 is disabled.
     * |        |          |If the connection is disabled, the USB host controller will not recognize any event of USB bus.
     * |        |          |Set this bit high, the transceiver of port 2 will also be forced into the standby mode no matter what USB host controller operation is.
     * |        |          |0 = The connection between USB host controller and transceiver of port 2 is enabled.
     * |        |          |1 = The connection between USB host controller and transceiver of port 2 is disabled and the transceiver of port 2 will also be forced into the standby mode.
    */
    __IO uint32_t HcMiscControl;

} USBH_T;

/**
    @addtogroup USBH_CONST USBH Bit Field Definition
    Constant Definitions for USBH Controller
@{ */

#define USBH_HcRevision_REV_Pos          (0)                                               /*!< USBH_T::HcRevision: REV Position          */
#define USBH_HcRevision_REV_Msk          (0xfful << USBH_HcRevision_REV_Pos)               /*!< USBH_T::HcRevision: REV Mask              */

#define USBH_HcControl_CBSR_Pos          (0)                                               /*!< USBH_T::HcControl: CBSR Position          */
#define USBH_HcControl_CBSR_Msk          (0x3ul << USBH_HcControl_CBSR_Pos)                /*!< USBH_T::HcControl: CBSR Mask              */

#define USBH_HcControl_PLE_Pos           (2)                                               /*!< USBH_T::HcControl: CBSR Position          */
#define USBH_HcControl_PLE_Msk           (0x1ul << USBH_HcControl_PLE_Pos)                 /*!< USBH_T::HcControl: CBSR Mask              */

#define USBH_HcControl_IE_Pos            (3)                                               /*!< USBH_T::HcControl: IE Position            */
#define USBH_HcControl_IE_Msk            (0x1ul << USBH_HcControl_IE_Pos)                  /*!< USBH_T::HcControl: IE Mask                */

#define USBH_HcControl_CLE_Pos           (4)                                               /*!< USBH_T::HcControl: CLE Position           */
#define USBH_HcControl_CLE_Msk           (0x1ul << USBH_HcControl_CLE_Pos)                 /*!< USBH_T::HcControl: CLE Mask               */

